openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564.h
/********************************** (C) COPYRIGHT  *******************************
 * File Name          : ch564.h
 * Author             : WCH
 * Version            : V1.0.0
 * Date               : 2024/05/05
 * Description        : CH564 Device Peripheral Access Layer Header File.
 *********************************************************************************
 * Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
 * Attention: This software (modified or not) and binary are used for
 * microcontroller manufactured by Nanjing Qinheng Microelectronics.
 *******************************************************************************/
#ifndef __CH564_H
#define __CH564_H

#ifdef __cplusplus
extern "C"
{
#endif

#define HSE_VALUE                       ((uint32_t)25000000)   /* Value of the External oscillator in Hz */
#define HSI_VALUE                       ((uint32_t)20000000)   /* Value of the Internal oscillator in Hz */

/* HSE HSI and PLL stabilization time(us) */
#define HSE_STARTUP_TIME                ((uint32_t)2500)
#define HSI_STARTUP_TIME                ((uint32_t)12)
#define PLL_STARTUP_TIME                ((uint32_t)35)


/* CH564 Standard Peripheral Library version number */
#define __CH564_STDPERIPH_VERSION_MAIN  (0x01)                 /* [15:8] main version */
#define __CH564_STDPERIPH_VERSION_SUB   (0x00)                 /* [7:0] sub version */
#define __CH564_STDPERIPH_VERSION       ((__CH564_STDPERIPH_VERSION_MAIN << 8)\
                                        | (__CH564_STDPERIPH_VERSION_SUB << 0))

/* ********************************************************************************************************************* */
/* Base types & constants */

#ifndef TRUE
#define TRUE                    1
#define FALSE                   0
#endif
#ifndef NULL
#define NULL                    0
#endif

#ifndef VOID
#define VOID                    void
#endif
#ifndef CONST
#define CONST                   const
#endif
#ifndef BOOL
typedef unsigned char           BOOL;
#endif
#ifndef BOOLEAN
typedef unsigned char           BOOLEAN;
#endif
#ifndef CHAR
typedef char                    CHAR;
#endif
#ifndef INT8
typedef char                    INT8;
#endif
#ifndef INT16
typedef short                   INT16;
#endif
#ifndef INT32
typedef long                    INT32;
#endif
#ifndef UINT8
typedef unsigned char           UINT8;
#endif
#ifndef UINT16
typedef unsigned short          UINT16;
#endif
#ifndef UINT32
typedef unsigned long           UINT32;
#endif
#ifndef UINT8V
typedef unsigned char volatile  UINT8V;
#endif
#ifndef UINT16V
typedef unsigned short volatile UINT16V;
#endif
#ifndef UINT32V
typedef unsigned long volatile  UINT32V;
#endif

#ifndef PVOID
typedef void                    *PVOID;
#endif
#ifndef PCHAR
typedef char                    *PCHAR;
#endif
#ifndef PCHAR
typedef const char              *PCCHAR;
#endif
#ifndef PINT8
typedef char                    *PINT8;
#endif
#ifndef PINT16
typedef short                   *PINT16;
#endif
#ifndef PINT32
typedef long                    *PINT32;
#endif
#ifndef PUINT8
typedef unsigned char           *PUINT8;
#endif
#ifndef PUINT16
typedef unsigned short          *PUINT16;
#endif
#ifndef PUINT32
typedef unsigned long           *PUINT32;
#endif
#ifndef PUINT8V
typedef volatile unsigned char  *PUINT8V;
#endif
#ifndef PUINT16V
typedef volatile unsigned short *PUINT16V;
#endif
#ifndef PUINT32V
typedef volatile unsigned long  *PUINT32V;
#endif

/* ********************************************************************************************************************* */
/* Base macros */

#ifndef min
#define min(a,b)                (((a) < (b)) ? (a) : (b))
#endif
#ifndef max
#define max(a,b)                (((a) > (b)) ? (a) : (b))
#endif

#if		DEBUG
#define PRINT(X...) printf(X)
#else
#define PRINT(X...)
#endif

/* Calculate the byte offset of a field in a structure of type */
#define FIELD_OFFSET(Type, Field)    ((UINT16)&(((Type *)0)->Field))

/* Calculate the size of a field in a structure of type */
#define FIELD_SIZE(Type, Field)      (sizeof(((Type *)0)->Field))

/* An expression that yields the type of a field in a struct */
#define FIELD_TYPE(Type, Field)      (((Type *)0)->Field)

/* Return the number of elements in a statically sized array */
#define NUMBER_OF(Array)             (sizeof(Array)/sizeof((Array)[0]))
#define NUMBER_OF_FIELD(Type, Field) (NUMBER_OF(FIELD_TYPE(Type, Field)))

/* Interrupt Number Definition, according to the selected device */
typedef enum IRQn
{
    /******  RISC-V Processor Exceptions Numbers *******************************************************/
    NonMaskableInt_IRQn         = 2,        /* 2 Non Maskable Interrupt                             */
    HardFault_IRQn              = 3,        /* 3 HardFault Interrupt                                */
    Ecall_M_Mode_IRQn           = 5,        /* 5 Ecall M Mode Interrupt                             */
    Ecall_U_Mode_IRQn           = 8,        /* 8 Ecall U Mode Interrupt                             */
    Break_Point_IRQn            = 9,        /* 9 Break Point Interrupt                              */
    SysTick_IRQn                = 12,       /* 12 System timer Interrupt                            */
    Software_IRQn               = 14,       /* 14 software Interrupt                                */
    /******  RISC-V specific Interrupt Numbers *********************************************************/
    IIC_EV_IRQn                 = 16,       /* 16 IIC Event Interrupt                               */
    IIC_ER_IRQn                 = 17,       /* 17 IIC Error Interrupt                               */
    ETH_IRQn                    = 18,       /* 18 ETH Global Interrupt                              */
    USBPD_IRQn                  = 19,       /* 19 USBPD Global Interrupt                            */
    TIM0_IRQn                   = 20,       /* 20 TIM0 Global Interrupt                             */
    TIM1_IRQn                   = 21,       /* 21 TIM1 Global Interrupt                             */
    TIM2_IRQn                   = 22,       /* 22 TIM2 Global Interrupt                             */
    TIM3_IRQn                   = 23,       /* 23 TIM3 Global Interrupt                             */
    SPI0_IRQn                   = 24,       /* 24 SPI0 Global Interrupt                             */
    SPI1_IRQn                   = 25,       /* 25 SPI1 Global Interrupt                             */
    UART0_IRQn                  = 26,       /* 26 UART0 Global Interrupt                            */
    UART1_IRQn                  = 27,       /* 27 UART1 Global Interrupt                            */
    PA_IRQn                     = 28,       /* 28 PA External Interrupt                             */
    PB_IRQn                     = 29,       /* 29 PB External Interrupt                             */
    PD_IRQn                     = 30,       /* 30 PC External Interrupt                             */
    ADC_IRQn                    = 31,       /* 31 ADC Global Interrupt                              */
    SLV_IRQn                    = 32,       /* 32 Slave Parallel Port Global Interrupt              */
    USBHS_HOST_IRQn             = 33,       /* 33 USBHOST Global Interrupt                          */
    USBHS_DEV_IRQn              = 34,       /* 34 USBDEVICE Global Interrupt                        */
    UART2_IRQn                  = 35,       /* 35 UART0 Global Interrupt                            */
    UART3_IRQn                  = 36,       /* 36 UART1 Global Interrupt                            */
    ETHWakeUp_IRQn              = 37,       /* 37 ETH Wake up Interrupt                             */
    USBHSWakeUp_IRQn            = 38,       /* 38 USBHS Wake up Interrupt                           */
    USBPDWakeUp_IRQn            = 39,       /* 39 USBPD Wake up Interrupt                           */
} IRQn_Type;

#include <stdint.h>
#include "core_riscv.h"
#include "system_ch564.h"

/* Reset and Clock Control */
typedef struct
{
    __IO uint8_t SAFE_ACCESS_SIG;
    uint8_t RESERVED0;
    __IO uint8_t SAFE_ACCESS_ID;
    __IO uint8_t WDOG_CLEAR;
    __IO uint8_t GLOB_MEM_CFG;
    __IO uint8_t GLOB_LOCK_PORT;
    __IO uint8_t GLOB_RST_CFG;
    __IO uint8_t GLOB_RESET_KEEP;
    uint8_t RESERVED1;
    __IO uint8_t PLL_OUT_DIV;
    uint16_t RESERVED2;
    __IO uint8_t SLP_CLK_OFF0;
    __IO uint8_t SLP_CLK_OFF1;
    __IO uint8_t SLP_WAKE_CTRL;
    __IO uint8_t SLP_CTRL_PLL;
} RCC_Typedef;

/* General Purpose Input Output */
typedef struct
{
    __IO uint32_t DIR;
    __IO uint32_t PIN;
    __IO uint32_t OUT;
    __IO uint32_t CLR;
    __IO uint32_t PU;
    __IO uint32_t PD;
} GPIO_Typedef;

