openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564.h
/* Alternate Function IO */
typedef struct
{
    __IO uint32_t PCFR1;
    __IO uint32_t PCFR2;
} AFIO_Typedef;

/* External Interrupts */
typedef struct
{
    __IO uint32_t STATUS;
    __IO uint32_t ENABLE;
    __IO uint32_t MODE;
    __IO uint32_t POLAR;
} EXTI_Typedef;

/* Timer */
typedef struct
{
    __IO uint8_t CTRL_MOD;
    __IO uint8_t CTRL_DMA;
    __IO uint8_t INTER_EN;
    uint8_t RESERVED0[3];
    __IO uint8_t INT_FLAG;
    __IO uint8_t FIFO_COUNT;
    __IO uint32_t COUNT;
    __IO uint32_t CNT_END;
    __IO uint32_t FIFO;
    union
    {
        __IO uint32_t TMR0_DMA_NOW;
        __IO uint32_t TMR1_DMA_NOW;
        __IO uint32_t TMR2_DMA_NOW;
        uint32_t RESERVED1;
    };
    union
    {
        __IO uint32_t TMR0_DMA_BEG;
        __IO uint32_t TMR1_DMA_BEG;
        __IO uint32_t TMR2_DMA_BEG;
        uint32_t RESERVED2;
    };
    union
    {
        __IO uint32_t TMR0_DMA_END;
        __IO uint32_t TMR1_DMA_END;
        __IO uint32_t TMR2_DMA_END;
        uint32_t RESERVED3;
    };

} TIM_Typedef;

/* Analog-to-Digital Converter */
typedef struct
{
    __IO uint8_t CTRL_MOD;
    __IO uint8_t CTRL_DMA;
    __IO uint8_t INTER_EN;
    __IO uint8_t CLOCK_DIV;
    __IO uint16_t DATA;
    __IO uint8_t INT_FLAG;
    __IO uint8_t FIFO_COUNT;
    __IO uint32_t CTRL;
    __IO uint16_t CMP_VALUE;
    uint16_t RESERVED0;
    __IO uint16_t FIFO;
    uint16_t RESERVED1;
    __IO uint32_t DMA_NOW;
    __IO uint32_t DMA_BEG;
    __IO uint32_t DMA_END;
} ADC_Typedef;

/* Universal Synchronous/Asynchronous Receiver/Transmitter */
typedef struct
{
    union
    {
        __IO uint8_t RBR;
        __IO uint8_t THR;
        __IO uint8_t DLL;
        __IO uint8_t ADR;
    };
    union
    {
        __IO uint8_t IER;
        __IO uint8_t DLM;
    };
    union
    {
        __IO uint8_t IIR;
        __IO uint8_t FCR;
    };
    __IO uint8_t LCR;
    __IO uint8_t MCR;
    __IO uint8_t LSR;
    __IO uint8_t MSR;
    __IO uint8_t DIV;
    __IO uint8_t DMA_CTRL;
    __IO uint8_t DMA_IF;
    uint16_t RESERVED0;
    __IO uint32_t DMA_WR_NOW_ADDR;
    __IO uint32_t DMA_WR_START_ADDR;
    __IO uint32_t DMA_WR_END_ADDR;
    __IO uint32_t DMA_RD_NOW_ADDR;
    __IO uint32_t DMA_RD_START_ADDR;
    __IO uint32_t DMA_RD_END_ADDR;
} UART_Typedef;

/* Inter Integrated Circuit Interface */
typedef struct
{
    __IO uint16_t CTLR1;
    uint16_t RESERVED0;
    __IO uint16_t CTLR2;
    uint16_t RESERVED1;
    __IO uint16_t OADDR1;
    uint16_t RESERVED2;
    __IO uint16_t OADDR2;
    uint16_t RESERVED3;
    __IO uint16_t DATAR;
    uint16_t RESERVED4;
    __IO uint16_t STAR1;
    uint16_t RESERVED5;
    __IO uint16_t STAR2;
    uint16_t RESERVED6;
    __IO uint16_t CKCFGR;
    uint16_t RESERVED7;
    __IO uint16_t RTR;
} I2C_Typedef;

/* Serial Peripheral Interface */
typedef struct
{
    union
    {
        __IO uint32_t CONTROL_R32;
        struct
        {
            __IO uint8_t CTRL_MOD;
            __IO uint8_t CTRL_DMA;
            __IO uint8_t INTER_EN;
            union
            {
                __IO uint8_t CLOCK_DIV;
                __IO uint8_t SLAVE_PRE;
            };
        };
    };
    union
    {
        __IO uint32_t STATUS_R32;
        struct
        {
            __IO uint8_t BUFFER;
            __IO uint8_t RUN_FLAG;
            __IO uint8_t INT_FLAG;
            __IO uint8_t FIFO_COUNT;
        };
    };
    __IO uint8_t RESET_CMD;
    __IO uint8_t BUSY;
    uint16_t RESERVED0;
    __IO uint16_t TOTAL_CNT;
    uint16_t RESERVED1;
    union
    {
        __IO uint32_t FIFO_R32;
        struct
        {
            __IO uint8_t FIFO;
            uint16_t RESERVED2;
            __IO uint8_t FIFO_COUNT1;
        };
    };
    union
    {
        __IO uint32_t SPI0_DMA_NOW;
        uint32_t RESERVED3;
    };
    union
    {
        __IO uint32_t SPI0_DMA_BEG;
        uint32_t RESERVED4;
    };
    union
    {
        __IO uint32_t SPI0_DMA_END;
        uint32_t RESERVED5;
    };
} SPI_Typedef;

/* passive parallel port (computing) */
typedef struct
{
    __IO uint8_t CONFIG;
    uint8_t RESERVED0;
    __IO uint8_t DOUT;
    __IO uint8_t STATUS;
    uint8_t RESERVED1[42];
    __IO uint8_t INT_FLAG_SLV;
    __IO uint8_t INT_SLV_DIN;
    uint8_t RESERVED2[316];
    __IO uint8_t DMA_EN_SLV;
    __IO uint8_t DMA_MODE_CTRL_SLV;
    __IO uint8_t DMA_MODE_EN_SLV;
    uint8_t RESERVED3;
    __IO uint8_t DMA_INT_FLAG_SLV;
    uint8_t RESERVED4[3];
    __IO uint32_t WR_DMA_START_ADDR_SLV;
    __IO uint32_t WR_DMA_END_ADDR_SLV;
    uint32_t RESERVED5;
    __IO uint32_t RD_DMA_START_ADDR_SLV;
    __IO uint32_t RD_DMA_END_ADDR_SLV;
    __IO uint32_t DMA_END_NOW_SLV;
    __IO uint8_t DMA_CMD0_SLV;
    __IO uint8_t DMA_CMD1_SLV;
    uint16_t RESERVED6;
    __IO uint8_t SLV_RESET_CMD;
    __IO uint8_t SLV_BUSY;
    uint8_t RESERVED7[10];
    __IO uint8_t OTHER_DATA;
    uint8_t RESERVED9[3];
    __IO uint16_t DMA_DEC_LEN;
    __IO uint16_t DMA_DEC_OFFSET;
} SLV_Typedef;

/* XBUS */
typedef struct
{
    __IO uint8_t CONFIG;
    uint8_t RESERVED0;
    __IO uint8_t CYCLE;
    __IO uint8_t SETUP_HOLD;
} XBUS_Typedef;

/* Ethernet MAC */
typedef struct
{
    __IO uint32_t MACCR;
    __IO uint32_t MACFFR;
    __IO uint32_t MACHTHR;
    __IO uint32_t MACHTLR;
    __IO uint32_t MACMIIAR;
    __IO uint32_t MACMIIDR;
    __IO uint32_t MACFCR;
    __IO uint32_t MACVLANTR;
    uint32_t RESERVED0[2];
    __IO uint32_t MACRWUFFR;
    __IO uint32_t MACPMTCSR;
    uint32_t RESERVED1[2];
    __IO uint32_t MACSR;
    __IO uint32_t MACIMR;
    __IO uint32_t MACA0HR;
    __IO uint32_t MACA0LR;
    __IO uint32_t MACA1HR;
    __IO uint32_t MACA1LR;
    __IO uint32_t MACA2HR;
    __IO uint32_t MACA2LR;
    __IO uint32_t MACA3HR;
    __IO uint32_t MACA3LR;
    uint32_t RESERVED2[8];
    __IO uint32_t PHY_CR;
    __IO uint32_t CHKSUM_CR;
    __IO uint32_t IP_PDR;
    __IO uint32_t CHKSUM_HR;
    __IO uint32_t CHKSUM_PR;
    uint32_t RESERVED3[27];
    __IO uint32_t MMCCR;
    __IO uint32_t MMCRIR;
    __IO uint32_t MMCTIR;
    __IO uint32_t MMCRIMR;
    __IO uint32_t MMCTIMR;
    uint32_t RESERVED4[14];
    __IO uint32_t MMCTGFSCCR;
    __IO uint32_t MMCTGFMSCCR;
    uint32_t RESERVED5[5];
    __IO uint32_t MMCTGFCR;
    uint32_t RESERVED6[10];
    __IO uint32_t MMCRFCECR;
    __IO uint32_t MMCRFAECR;
    __IO uint32_t MMCRAFCR;
    __IO uint32_t ETH_STATE;
    uint32_t RESERVED7[8];
    __IO uint32_t MMCRGUFCR;
    uint32_t RESERVED8[334];
    __IO uint32_t PTPTSCR;
    __IO uint32_t PTPSSIR;
    __IO uint32_t PTPTSHR;
    __IO uint32_t PTPTSLR;
    __IO uint32_t PTPTSHUR;
    __IO uint32_t PTPTSLUR;
    __IO uint32_t PTPTSAR;
    __IO uint32_t PTPTTHR;
    __IO uint32_t PTPTTLR;
    uint32_t RESERVED9[567];
    __IO uint32_t DMABMR;
    __IO uint32_t DMATPDR;
    __IO uint32_t DMARPDR;
    __IO uint32_t DMARDLAR;
    __IO uint32_t DMATDLAR;
    __IO uint32_t DMASR;
    __IO uint32_t DMAOMR;
    __IO uint32_t DMAIER;
    __IO uint32_t DMAMFBOCR;
    uint32_t RESERVED10[9];
    __IO uint32_t DMACHTDR;
    __IO uint32_t DMACHRDR;
    __IO uint32_t DMACHTBAR;
    __IO uint32_t DMACHRBAR;
} ETH_Typedef;

/* USB Power Delivery */
typedef struct
{
    union
    {
        __IO uint32_t CONFIG_R32;
        struct
        {
            __IO uint16_t CONFIG;
            __IO uint16_t BMC_CLK_CNT;
        };
    };
    union
    {
        __IO uint32_t CONTROL_R32;
        struct
        {
            union
            {
                __IO uint16_t CONTROL_R16;
                struct
                {
                    __IO uint8_t CONTROL;
                    __IO uint8_t TX_SEL;
                };
            };
            __IO uint16_t BMC_TX_SZ;
        };
    };
    union
    {
        __IO uint32_t STATUS_R32;
        struct
        {
            union
            {
                __IO uint16_t STATUS_16;
                struct
                {
                    __IO uint8_t DATA_BUF;
                    __IO uint8_t STATUS;
                };
            };
            __IO uint16_t BMC_BYTE_CNT;
        };
    };
    union
    {
        __IO uint32_t PORT_R32;
        struct
        {
            __IO uint16_t PORT_CC1;
            __IO uint16_t PORT_CC2;
        };
    };
    union
    {
        __IO uint32_t DMA_R32;
        struct
        {
            __IO uint16_t DMA;
            uint16_t RESERVED0;
        };
    };
} USBPD_Typedef;

/* USB High-Speed Device */
typedef struct
{
  __IO uint8_t  CONTROL;
  __IO uint8_t  BASE_MODE;
  __IO uint8_t  INT_EN;
  __IO uint8_t  DEV_AD;
  __IO uint8_t  WAKE_CR;
  __IO uint8_t  TEST_MODE;
  __IO uint16_t LPM_DATA;
  __IO uint8_t  INT_FG;
  __IO uint8_t  INT_ST;
  __IO uint8_t  MIS_ST;
  __IO uint8_t  reserve1;
  __IO uint16_t FRAME_NO;
  __IO uint16_t USB_BUS;
  __IO uint16_t UEP_TX_EN;
  __IO uint16_t UEP_RX_EN;
  __IO uint16_t UEP_T_TOG_AUTO;
  __IO uint16_t UEP_R_TOG_AUTO;
  __IO uint16_t UEP_T_BURST;
  __IO uint16_t UEP_R_BURST;
  __IO uint32_t UEP_AF_MODE;
  __IO uint32_t UEP0_DMA;
  __IO uint32_t UEP1_RX_DMA;
  __IO uint32_t UEP2_RX_DMA;
  __IO uint32_t UEP3_RX_DMA;
  __IO uint32_t UEP4_RX_DMA;
  __IO uint32_t UEP5_RX_DMA;
  __IO uint32_t UEP6_RX_DMA;
  __IO uint32_t UEP7_RX_DMA;
  __IO uint32_t UEP1_TX_DMA;
  __IO uint32_t UEP2_TX_DMA;
  __IO uint32_t UEP3_TX_DMA;
  __IO uint32_t UEP4_TX_DMA;
  __IO uint32_t UEP5_TX_DMA;
  __IO uint32_t UEP6_TX_DMA;
  __IO uint32_t UEP7_TX_DMA;
  __IO uint32_t UEP0_MAX_LEN;
  __IO uint32_t UEP1_MAX_LEN;
  __IO uint32_t UEP2_MAX_LEN;
  __IO uint32_t UEP3_MAX_LEN;
  __IO uint32_t UEP4_MAX_LEN;
  __IO uint32_t UEP5_MAX_LEN;
  __IO uint32_t UEP6_MAX_LEN;
  __IO uint32_t UEP7_MAX_LEN;
  __IO uint16_t UEP0_RX_LEN;
  __IO uint16_t UEP0_RX_SIZE;
  __IO uint16_t UEP1_RX_LEN;
  __IO uint16_t UEP1_RX_SIZE;
  __IO uint16_t UEP2_RX_LEN;
  __IO uint16_t UEP2_RX_SIZE;
  __IO uint16_t UEP3_RX_LEN;
  __IO uint16_t UEP3_RX_SIZE;
  __IO uint16_t UEP4_RX_LEN;
  __IO uint16_t UEP4_RX_SIZE;
  __IO uint16_t UEP5_RX_LEN;
  __IO uint16_t UEP5_RX_SIZE;
  __IO uint16_t UEP6_RX_LEN;
  __IO uint16_t UEP6_RX_SIZE;
  __IO uint16_t UEP7_RX_LEN;
  __IO uint16_t UEP7_RX_SIZE;
  __IO uint16_t UEP0_TX_LEN;
  __IO uint8_t  UEP0_TX_CTRL;
  __IO uint8_t  UEP0_RX_CTRL;
  __IO uint16_t UEP1_TX_LEN;
  __IO uint8_t  UEP1_TX_CTRL;
  __IO uint8_t  UEP1_RX_CTRL;
  __IO uint16_t UEP2_TX_LEN;
  __IO uint8_t  UEP2_TX_CTRL;
  __IO uint8_t  UEP2_RX_CTRL;
  __IO uint16_t UEP3_TX_LEN;
  __IO uint8_t  UEP3_TX_CTRL;
  __IO uint8_t  UEP3_RX_CTRL;
  __IO uint16_t UEP4_TX_LEN;
  __IO uint8_t  UEP4_TX_CTRL;
  __IO uint8_t  UEP4_RX_CTRL;
  __IO uint16_t UEP5_TX_LEN;
  __IO uint8_t  UEP5_TX_CTRL;
  __IO uint8_t  UEP5_RX_CTRL;
  __IO uint16_t UEP6_TX_LEN;
  __IO uint8_t  UEP6_TX_CTRL;
  __IO uint8_t  UEP6_RX_CTRL;
  __IO uint16_t UEP7_TX_LEN;
  __IO uint8_t  UEP7_TX_CTRL;
  __IO uint8_t  UEP7_RX_CTRL;
  __IO uint16_t UEP_TX_ISO;
  __IO uint16_t UEP_RX_ISO;
} USBHSD_TypeDef;

typedef struct
{
  __IO uint8_t   CFG;
  __IO uint8_t   RESERVE1;
  __IO uint8_t   INT_EN;
  __IO uint8_t   DEV_AD;
  __IO uint32_t  CONTROL;
  __IO uint8_t   INT_FG;
  __IO uint8_t   INT_ST;
  __IO uint8_t   MIS_ST;
  __IO uint8_t   RESERVE2;
  __IO uint32_t  LPM;
  __IO uint32_t  SPLIT;
  __IO uint32_t  FRAME;
  __IO uint32_t  HOST_TX_LEN;
  __IO uint32_t  RX_LEN;
  __IO uint32_t  HOST_RX_MAX_LEN;
  __IO uint32_t  HOST_RX_DMA;
  __IO uint32_t  HOST_TX_DMA;
  __IO uint32_t  PORT_CTRL;
  __IO uint8_t   PORT_CFG;
  __IO uint8_t   RESERVE3;
  __IO uint8_t   PORT_INT_EN;
  __IO uint8_t   PORT_TEST_CT;
  __IO uint16_t  PORT_STATUS;
  __IO uint8_t   PORT_STATUS_CHG;
  __IO uint32_t  RESERVE4;
  __IO uint32_t  ROOT_BC_CR;
} USBHSH_TypeDef;

typedef struct
{
  __IO uint32_t  CAL_CR;
} USBHSI_TypeDef;

/* Expansion Registers */
typedef struct
{
    __IO uint32_t CTLR0;
    uint32_t RESERVED0[3];
    __IO uint32_t CTLR1;
    uint32_t RESERVED1[5];
    __IO uint32_t CTLR2;
} EXTEN_Typedef;

/* Flash Registers */
typedef struct
{
    __IO uint8_t DATA;
    uint8_t RESERVED0;
    __IO uint8_t CTRL;
    __IO uint16_t FLASHA_KEY_BUF;
} FLASH_Typedef;

/* Debug Registers */
typedef struct
{
    __IO uint32_t CR;
} DBG_Typedef;

