openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564.h
#define RCC_BASE        ((uint32_t)0x40400000)
#define GPIOA_BASE      ((uint32_t)0x40400080)
#define GPIOB_BASE      ((uint32_t)0x404000A0)
#define GPIOD_BASE      ((uint32_t)0x404000C0)
#define AFIO_BASE       ((uint32_t)0x40400100)
#define EXTIA_BASE      ((uint32_t)0x40400050)
#define EXTIB_BASE      ((uint32_t)0x40400060)
#define EXTID_BASE      ((uint32_t)0x40400070)
#define TIM0_BASE       ((uint32_t)0x40408000)
#define TIM1_BASE       ((uint32_t)0x40408400)
#define TIM2_BASE       ((uint32_t)0x40408800)
#define TIM3_BASE       ((uint32_t)0x40408C00)
#define ADC_BASE        ((uint32_t)0x4040A000)
#define UART0_BASE      ((uint32_t)0x4040D000)
#define UART1_BASE      ((uint32_t)0x4040D800)
#define UART2_BASE      ((uint32_t)0x40409000)
#define UART3_BASE      ((uint32_t)0x40409800)
#define I2C_BASE        ((uint32_t)0x4040F000)
#define SPI0_BASE       ((uint32_t)0x4040C000)
#define SPI1_BASE       ((uint32_t)0x4040C800)
#define SLV_BASE        ((uint32_t)0x40400014)
#define XBUS_BASE       ((uint32_t)0x40400010)
#define ETH_BASE        ((uint32_t)0x40406000)
#define USBPD_BASE      ((uint32_t)0x4040E000)
#define USBHSD_BASE     ((uint32_t)0x40404000)
#define USBHSH_BASE     ((uint32_t)0x40404800)
#define USB_HSI_BASE    ((uint32_t)0x40005000)
#define EXTEN_BASE      ((uint32_t)0x40400144)
#define FLASH_BASE      ((uint32_t)0x40400018)

#define RCC         ((RCC_Typedef *)RCC_BASE)
#define GPIOA       ((GPIO_Typedef *)GPIOA_BASE)
#define GPIOB       ((GPIO_Typedef *)GPIOB_BASE)
#define GPIOD       ((GPIO_Typedef *)GPIOD_BASE)
#define AFIO        ((AFIO_Typedef *)AFIO_BASE)
#define EXTIA       ((EXTI_Typedef *)EXTIA_BASE)
#define EXTIB       ((EXTI_Typedef *)EXTIB_BASE)
#define EXTID       ((EXTI_Typedef *)EXTID_BASE)
#define TIM0        ((TIM_Typedef *)TIM0_BASE)
#define TIM1        ((TIM_Typedef *)TIM1_BASE)
#define TIM2        ((TIM_Typedef *)TIM2_BASE)
#define TIM3        ((TIM_Typedef *)TIM3_BASE)
#define ADC         ((ADC_Typedef *)ADC_BASE)
#define UART0       ((UART_Typedef *)UART0_BASE)
#define UART1       ((UART_Typedef *)UART1_BASE)
#define UART2       ((UART_Typedef *)UART2_BASE)
#define UART3       ((UART_Typedef *)UART3_BASE)
#define I2C         ((I2C_Typedef *)I2C_BASE)
#define SPI0        ((SPI_Typedef *)SPI0_BASE)
#define SPI1        ((SPI_Typedef *)SPI1_BASE)
#define SLV         ((SLV_Typedef *)SLV_BASE)
#define XBUS        ((XBUS_Typedef *)XBUS_BASE)
#define ETH         ((ETH_Typedef *)ETH_BASE)
#define USBPD       ((USBPD_Typedef *)USBPD_BASE)
#define USBHSD      ((USBHSD_TypeDef *) USBHSD_BASE)
#define USBHSH      ((USBHSH_TypeDef *) USBHSH_BASE)
#define USB_HSI     ((USBHSI_TypeDef *) USB_HSI_BASE)
#define EXTEN       ((EXTEN_Typedef *)EXTEN_BASE)
#define FLASH       ((FLASH_Typedef *)FLASH_BASE)
#define DBG         ((DBG_Typedef *)DBG_BASE)

/* Standard Peripheral Library old definitions (maintained for legacy purpose) */
#define HSI_Value                       HSI_VALUE
#define HSE_Value                       HSE_VALUE


/******************************************************************************/

// Address Space
//   CODE:   00000000H - 000FFFFFH, 1MB
//    SFR:   00400000H - 0040FFFFH, 64KB
//   DATA:   00808000H - 0081FFFFH, 96KB/64KB/32KB
//   XBUS:   00C00000H - 00CFFFFFH, 1MB
//  OTHER:   00E00000H - FFFFFFFFH, undefined
//
//    SFR:   00400000H - 0040FFFFH, 64KB
//      SYS:    +1000H - 1FFFH, include base config, interrupt, GPIO, etc...
//      USB:    +4000H - 5FFFH
//      ETH:    +6000H - 7FFFH
//      TMR0:   +8000H - 83FFH
//      TMR1:   +8400H - 87FFH
//      TMR2:   +8800H - 8BFFH
//      TMR3:   +8C00H - 8FFFH
//      ADC:    +A000H - AFFFH
//      SPI0:   +C000H - C7FFH
//      SPI1:   +C800H - CFFFH
//      UART0:  +D000H - D7FFH
//      UART1:  +D800H - DFFFH

// Register Bit Attribute / Bit Access Type
//   RF:    Read only for Fixed value
//   RO:    Read Only (internal change)
//   RZ:    Read only with auto clear Zero
//   WO:    Write Only (read zero or different)
//   WA:    Write only under safe Accessing mode (read zero or different)
//   WZ:    Write only with auto clear Zero
//   RW:    Read / Write
//   RWA:   Read / Write under safe Accessing mode
//   RW1:   Read / Write 1 to Clear

/* Register name rule:
R32_* for 32 bits register (UINT32,ULONG)
R16_* for 16 bits register (UINT16,USHORT)
R8_*  for  8 bits register (UINT8,UCHAR)
RB_*  for bit or bit mask of 8 bit register
BA_*  for base address point
Others for register address offset */

/* ********************************************************************************************************************* */
/* System: safe accessing register */
#define R32_SAFE_ACCESS                                 (*((volatile uint32_t *)0x40400000))                        // RW, safe accessing
#define R8_SAFE_ACCESS_SIG                              (*((volatile uint8_t *)0x40400000))                         // WO, safe accessing sign register, must write 0x57 then 0xA8 to enter safe accessing mode
#define RB_SAFE_ACC_MODE                                0x03                                                        // RO, current safe accessing mode: 11=safe/unlocked (SAM), other=locked (00..01..10..11)
#define RB_SAFE_ACC_TIMER                               0x70                                                        // RO, safe accessing timer bit mask (16*clock number)
#define R8_SAFE_ACCESS_ID                               (*((volatile uint8_t *)0x40400002))                         // RF, safe accessing ID register, always 0x01
#define R8_WDOG_CLEAR                                   (*((volatile uint8_t *)0x40400003))                         // WO, clear watch-dog
        
/* System: global configuration register */     
#define R32_GLOBAL_CONFIG                               (*((volatile uint32_t *)0x40400004))                        // RW, global configuration
#define R8_GLOB_MEM_CFG                                 (*((volatile uint8_t *)0x40400004))                         // RWA, global memory configuration, SAM and bit7:6 must write 1:0
#define RB_GLOB_MEM_CFG                                 0x03                                                        // RWA, global memory config: 10=C96K/D32K, 11=C32K/D96K, 00/01=C64K/D64K
#define RB_GLOB_CFG_FLAG                                0x80                                                        // RO, global config flag
#define R8_GLOB_LOCK_PORT                               (*((volatile uint8_t *)0x40400005))                         // RWA, lock port configuration, SAM and bit7:6 must write 0:0
#define RB_GLOB_LOCK_PA                                 0x01                                                        // RWA, lock GPIO PA
#define RB_GLOB_LOCK_PB                                 0x02                                                        // RWA, lock GPIO PB
#define RB_GLOB_LOCK_PD                                 0x08                                                        // RWA, lock GPIO PD
#define R8_GLOB_RST_CFG                                 (*((volatile uint8_t *)0x40400006))                         // RWA, global reset configuration, SAM and bit7:6 must write 0:1
#define RB_GLOB_FORCE_RST                               0x01                                                        // WA/WZ, force global reset, high action, auto clear
#define RB_GLOB_WDOG_EN                                 0x02                                                        // RWA, watch-dog enable
#define R8_GLOB_RESET_KEEP                              (*((volatile uint8_t *)0x40400007))                         // RW, value keeper during global reset
        
/* System: PLL configuration register */        
#define R32_PLL_CONFIG                                  (*((volatile uint32_t *)0x40400008))                        // RWA, PLL configuration, SAM
#define R8_PLL_OUT_DIV                                  (*((volatile uint8_t *)0x40400009))                         // RWA, PLL output clock divider, SAM and bit7:6 must write 1:0
#define RB_PLL_ETH_DIV                                  0x0F                                                        // RWA, PLL ethernet clock divider
#define RB_PLL_SYS_DIV                                  0x30                                                        // RWA, PLL system clock divider

