openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564.h
/* System: sleep control register */
#define R32_SLEEP_CONTROL                               (*((volatile uint32_t *)0x4040000C))                        // RWA, sleep control, SAM
#define R8_SLP_CLK_OFF0                                 (*((volatile uint8_t *)0x4040000C))                         // RWA, sleep clock off control byte 0, SAM
#define RB_SLP_CLK_TMR0                                 0x01                                                        // RWA, sleep TMR0 clock
#define RB_SLP_CLK_TMR1                                 0x02                                                        // RWA, sleep TMR1 clock
#define RB_SLP_CLK_TMR2                                 0x04                                                        // RWA, sleep TMR2 clock
#define RB_SLP_CLK_TMR3                                 0x08                                                        // RWA, sleep TMR3 clock
#define RB_SLP_CLK_SPI0                                 0x10                                                        // RWA, sleep SPI0 clock
#define RB_SLP_CLK_SPI1                                 0x20                                                        // RWA, sleep SPI1 clock
#define RB_SLP_CLK_UART0                                0x40                                                        // RWA, sleep UART0 clock
#define RB_SLP_CLK_UART1                                0x80                                                        // RWA, sleep UART1 clock
#define R8_SLP_CLK_OFF1                                 (*((volatile uint8_t *)0x4040000D))                         // RWA, sleep clock off control byte 1, SAM
#define RB_SLP_CLK_UTMI                                 0x02                                                        // RWA, sleep UTMI clock
#define RB_SLP_CLK_I2C                                  0x04                                                        // RWA, sleep I2C clock
#define RB_SLP_CLK_USBPD                                0x08                                                        // RWA, sleep USBPD clock
#define RB_SLP_CLK_ADC                                  0x10                                                        // RWA, sleep ADC clock
#define RB_SLP_CLK_GPIO                                 0x20                                                        // RWA, sleep GPIO clock
#define RB_SLP_CLK_USB                                  0x40                                                        // RWA, sleep USB clock
#define RB_SLP_CLK_ETH                                  0x80                                                        // RWA, sleep Ethernet clock
#define R8_SLP_WAKE_CTRL                                (*((volatile uint8_t *)0x4040000E))                         // RWA, wake control, SAM
#define RB_SLP_PA_WAKE                                  0x01                                                        // RWA，enable PA waking
#define RB_SLP_PB_WAKE                                  0x02                                                        // RWA，enable PB waking
#define RB_SLP_USBPD_WAKE                               0x04                                                        // RWA，enable USBPD waking
#define RB_SLP_PD_WAKE                                  0x08                                                        // RWA，enable PD waking
#define RB_SLP_USB_WAKE                                 0x10                                                        // RWA，enable USB waking
#define RB_SLP_WOL_WAKE                                 0x40                                                        // RWA，enable Ethernet WOL waking
#define RB_SLP_ETH_PWR_DN                               0x80                                                        // RWA，Ethernet module power control
#define R8_SLP_CTRL_PLL                                 (*((volatile uint8_t *)0x4040000F))                         // WA, PLL sleep control, SAM and write 0x6A to sleep CPU or write 0x95 to sleep PLL
#define R8_SLP_STATUS                                   (*((volatile uint8_t *)0x4040000F))                         // RO, sleep status
#define RB_SLP_WOL_STATUS                               0x01                                                        // RO, current ethernet WOL status
#define RB_SLP_CLK_UART2                                0x02                                                        // RWA, sleep UART2 clock
#define RB_SLP_CLK_UART3                                0x04                                                        // RWA, sleep UART3 clock
/* System: external bus configuration register */                       
#define R32_EXT_BUS_CFG                                 (*((volatile uint32_t *)0x40400010))                        // RW, external bus configuration
#define R8_XBUS_CONFIG                                  (*((volatile uint8_t *)0x40400010))                         // RW, external bus configuration
#define RB_XBUS_ENABLE                                  0x01                                                        // RWA, external bus enable
#define RB_XBUS_EN_32BIT                                0x02                                                        // RW, enable 16bit or 32bit external bus
#define RB_XBUS_ADDR_OE                                 0x0C                                                        // RWA, bus address output enable: 00=none,01=PA[5:0],10=PA[11:0],11=PA[19:0]
#define R8_XBUS_CYCLE                                   (*((volatile uint8_t *)0x40400012))                         // RW, external bus total cycle (clock number), only low 5 bit
#define R8_XBUS_SETUP_HOLD                              (*((volatile uint8_t *)0x40400013))                         // RW, external bus setup and hold config
#define RB_XBUS_HOLD                                    0x1F                                                        // RW, external bus hold time bit mask (clock number)
#define RB_XBUS_SETUP                                   0x80                                                        // RW, external bus setup time: 0=1 clock, 1=2 clocks

/* System: parallel slave configuration register */                     
#define R32_PARA_SLV_CFG                                (*((volatile uint32_t *)0x40400014))                        // RW, parallel slave configuration
#define R8_SLV_CONFIG                                   (*((volatile uint8_t *)0x40400014))                         // RWA, parallel slave configuration, SAM
#define RB_SLV_ENABLE                                   0x01                                                        // RWA, parallel slave enable
#define RB_SLV_IE_CMD                                   0x02                                                        // RWA, enable interrupt for slave writing command event
#define RB_SLV_IE_WR                                    0x04                                                        // RWA, enable interrupt for slave writing event
#define RB_SLV_IE_RD                                    0x08                                                        // RWA, enable interrupt for slave reading event
#define R8_SLV_DOUT                                     (*((volatile uint8_t *)0x40400016))                         // RW, parallel slave data to output
#define R8_SLV_STATUS                                   (*((volatile uint8_t *)0x40400017))                         // RW, parallel slave status to output, only low 7 bit

