openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564.h
/* System: miscell control register */                      
#define R32_MISCELL_CTRL                                (*((volatile uint32_t *)0x4040001C))                        // RW, miscell control
#define R8_MISC_CTRL_ETH                                (*((volatile uint8_t *)0x4040001C))                         // RW, miscell control for ethernet
#define RB_MISC_ETH_RX                                  0x01                                                        // RW, miscell control ethernet rx LED enable
#define RB_MISC_ETH_TX                                  0x02                                                        // RW, miscell control ethernet tx LED enable
#define RB_MISC_ETH_LED                                 0x04                                                        // RW, miscell control ethernet link LED enable
#define RB_MISC_ETH_RST                                 0x80                                                        // RW, miscell control ethernet transceiver reset
#define R8_MISC_CTRL_USB                                (*((volatile uint8_t *)0x4040001D))                         // RW, miscell control for USB
#define RB_MISC_USB_VBUS                                0x01                                                        // RW, miscell control USB OTG VBUS pin enable
#define RB_MISC_USB_ID_EN                               0x02                                                        // RW, miscell control USB OTG ID pin enable
#define RB_MISC_USB_ID_ST                               0x08                                                        // RW, miscell control USB OTG ID setting value
#define R8_MISC_CTRL_OTHER                              (*((volatile uint8_t *)0x4040001E))                         // RW, miscell control for others
#define RB_MISC_PECL_EN                                 0x01                                                        // RW, miscell control PECL input enable

/* Interrupt vector register */                     
#define R32_INT_VEC_CTRL                                (*((volatile uint32_t *)0x40400020))                        // RWA, interrupt vector control, SAM
#define R8_INT_VEC_IRQ                                  (*((volatile uint8_t *)0x40400020))                         // RWA, IRQ normal interrupt vector control, SAM
#define RB_IV_IRQ_TMR0                                  0x01                                                        // RWA, TMR0 IRQ vector enable
#define RB_IV_IRQ_SPI0                                  0x02                                                        // RWA, SPI0 IRQ vector enable
#define RB_IV_IRQ_PB                                    0x04                                                        // RWA, GPIO PB IRQ vector enable
#define R8_INT_VEC_FIQ                                  (*((volatile uint8_t *)0x40400021))                         // RWA, FIQ fast interrupt vector control, SAM
#define RB_IV_FIQ_TMR0                                  0x01                                                        // RWA, TMR0 FIQ vector enable
#define RB_IV_FIQ_SPI0                                  0x02                                                        // RWA, SPI0 FIQ vector enable
#define RB_IV_FIQ_PB                                    0x04                                                        // RWA, GPIO PB FIQ vector enable
#define R32_INT_VEC_TMR0                                (*((volatile uint32_t *)0x40400024))                        // RWA, interrupt vector for TMR0, SAM
#define R32_INT_VEC_SPI0                                (*((volatile uint32_t *)0x40400028))                        // RWA, interrupt vector for SPI0, SAM
#define R32_INT_VEC_PB                                  (*((volatile uint32_t *)0x4040002C))                        // RWA, interrupt vector for GPIO PB, SAM

/* Interrupt flag register */                       
#define R32_INT_FLAG                                    (*((volatile uint32_t *)0x40400040))                        // RW, interrupt flag
#define R8_INT_FLAG_0                                   (*((volatile uint8_t *)0x40400040))                         // RO, interrupt flag byte 0
#define RB_IF_TMR0                                      0x01                                                        // RO, interrupt flag of TMR0
#define RB_IF_TMR1                                      0x02                                                        // RO, interrupt flag of TMR1
#define RB_IF_TMR2                                      0x04                                                        // RO, interrupt flag of TMR2
#define RB_IF_TMR3                                      0x08                                                        // RO, interrupt flag of TMR3
#define RB_IF_SPI0                                      0x10                                                        // RO, interrupt flag of SPI0
#define RB_IF_SPI1                                      0x20                                                        // RO, interrupt flag of SPI1
#define RB_IF_UART0                                     0x40                                                        // RO, interrupt flag of UART0
#define RB_IF_UART1                                     0x80                                                        // RO, interrupt flag of UART1
#define R8_INT_FLAG_1                                   (*((volatile uint8_t *)0x40400041))                         // RO, interrupt flag byte 1
#define RB_IF_PA                                        0x01                                                        // RO, interrupt flag of GPIO PA
#define RB_IF_PB                                        0x02                                                        // RO, interrupt flag of GPIO PB
#define RB_INT_WOL_STATUS                               0x04                                                        // RO, current ethernet WOL status
#define RB_IF_PD                                        0x08                                                        // RO, interrupt flag of GPIO PD
#define RB_IF_ADC                                       0x10                                                        // RO, interrupt flag of ADC
#define RB_IF_SLV                                       0x20                                                        // RO, interrupt flag of parallel slave
#define RB_IF_USB                                       0x40                                                        // RO, interrupt flag of USB
#define RB_IF_ETH                                       0x80                                                        // RO, interrupt flag of ethernet
#define R8_INT_FLAG_SLV                                 (*((volatile uint8_t *)0x40400042))                         // RW1, parallel slave interrupt flag
#define RB_IF_SLV_CMD0                                  0x10                                                        // RO, parallel slave command raw flag
#define RB_IF_SLV_CMD                                   0x20                                                        // RO, parallel slave command synchro flag
#define RB_IF_SLV_WR                                    0x40                                                        // RW1, interrupt flag of parallel slave writing event
#define RB_IF_SLV_RD                                    0x80                                                        // RW1, interrupt flag of parallel slave reading event
#define R8_INT_SLV_DIN                                  (*((volatile uint8_t *)0x40400043))                         // RO, parallel slave data input
/*SLV DMA enable register*/
#define R8_DMA_EN_SLV                                   (*((volatile uint8_t *)0x40400180))                         //SLV DMA enable register
#define RB_DMA_EN_SLV                                   0x01                                                        //SLV DMA mode enable control bit
#define RB_DMA_RESP_IE_SLV                              0x02                                                        //SLV DMA error transmission interrupts enable control bit
#define RB_DMA_END_IE_SLV                               0x04                                                        //SLV DMA error transmission end enable control bit
#define RB_DMA_LOOP_EN_SLV                              0x08                                                        //SLV DMA cyclic address mode control bits
#define RB_DMA_FIFO_OV_IE_SLV                           0x10                                                        //The FIFO full state interrupts the enable bit
#define RB_DMA_OTHER_IE_SLV                             0x20                                                        //when in compatibility mode, Transmission of non-DMA datastate interrupts the enable bit
#define RB_DMA_WR_8BIT                                  0x40                                                        //selection of transfer data length for DMA write operations
/*SLV DMA mode control register*/                   
#define R8_DMA_MODE_CTRL_SLV                            (*((volatile uint8_t *)0x40400181))                         //SLV DMA mode control register
#define CMD0_WR_MODE                                    0x40                                                        //DMA transfer command word 0 read and write type
#define CMD1_WR_MODE                                    0x80                                                        //DMA transfer command word 1 read and write type
/*SLV DMA mode enable register*/                    
#define R8_DMA_MODE_EN_SLV                              (*((volatile uint8_t *)0x40400182))                         //SLV DMA mode enable register
#define CMD0_EN                                         0x01                                                        //DMA transfer command word 0 control bit
#define CMD1_EN                                         0x02                                                        //DMA transfer command word 1 control bit
#define DMA_CMD_MODE1                                   0x08                                                        //DMA transfer command word mode1
/*SLV DMA interrupt flag register*/                 
#define R8_DMA_INT_FLAG_SLV                             (*((volatile uint8_t *)0x40400184))                         //SLV DMA interrupt flag register
#define WR_DMA_END_IF                                   0x01                                                        //DMA receive mode transmission end flag bit
#define WR_DMA_RESP_IF                                  0x02                                                        //DMA receive mode transmission error flag bit
#define RD_DMA_END_IF                                   0x04                                                        //DMA occurrence mode transmission end flag bit
#define RD_DMA_RESP_IF                                  0x08                                                        //DMA occurrence mode transmission error flag bit
#define WR_DMA_OV_IF                                    0x10                                                        //input FIFO full flag
#define WR_OTHER_IF                                     0x20                                                        //data are written to the flag bit
#define DATA_IN_FIFO_EMPTY                              0x40                                                        //Whether DATA_IN_FIFO is empty
/*DMA receive mode start address register*/                 
#define R32_WR_DMA_START_ADDR_SLV                       (*((volatile uint32_t *)0x40400188))                        //DMA receive mode start address register
#define MASK_WR_DMA_START_ADDR_SLV                      0x0003ffff                                                  //DMA receive mode start address
/*DMA receive mode end address register*/                   
#define R32_WR_DMA_END_ADDR_SLV                         (*((volatile uint32_t *)0x4040018c))                        //DMA receive mode end address register
#define MASK_WR_DMA_START_ADDR_SLV                      0x0003ffff                                                  //DMA receive mode end address
/*DMA send mode start address register*/                    
#define R32_RD_DMA_START_ADDR_SLV                       (*((volatile uint32_t *)0x40400194))                        //DMA send mode start address register
#define MASK_RD_DMA_START_ADDR_SLV                      0x0003ffff                                                  //DMA send mode start address
/*DMA send mode end address register*/                  
#define R32_RD_DMA_END_ADDR_SLV                         (*((volatile uint32_t *)0x40400198))                        //DMA send mode end address register
#define MASK_RD_DMA_START_ADDR_SLV                      0x0003ffff                                                  //DMA send mode end address
/*DMA current address register*/                    
#define R32_DMA_END_NOW_SLV                             (*((volatile uint32_t *)0x4040019c))                        //DMA current address register
#define MASK_DMA_NOW_ADDR_SLV                           0x0003ffff                                                  //DMA current address
/*DMA mode command word0 register*/                 
#define R8_DMA_CMD0_SLV                                 (*((volatile uint8_t *)0x404001a0))                         //DMA mode command word0 register
/*DMA mode command word1 register*/                 
#define R8_DMA_CMD1_SLV                                 (*((volatile uint8_t *)0x404001a1))                         //DMA mode command word1 register
/*DMA reset the command word register*/                 
#define R8_SLV_RESET_CMD                                (*((volatile uint8_t *)0x404001a4))                         //DMA reset the command word register
/*SLV busy flag register*/                  
#define R8_SLV_BUSY                                     (*((volatile uint8_t *)0x404001a5))                         //SLV busy flag register
#define RB_SLV_BUSY                                     0x01                                                        //SLV busy flag
/*Non-DMA writes to the data register*/                 
#define R8_OTHER_DATA                                   (*((volatile uint8_t *)0x404001b0))                         //Non-DMA writes to the data register
/*DMA parses length register*/                  
#define R16_DMA_DEC_LEN                                 (*((volatile uint16_t *)0x404001b4))                        //DMA parses length register
/*DMA resolves the offset address register*/                    
#define R16_DMA_DEC_OFFSET                              (*((volatile uint16_t *)0x404001b6))                        //DMA resolves the offset address register


