openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564.h
/* GPIO PA interrupt register */
#define R32_INT_STATUS_PA                               (*((volatile uint32_t *)0x40400050))                        // RW1, GPIO PA interrupt flag
#define R8_INT_STATUS_PA_1                              (*((volatile uint8_t *)0x40400051))                         // RW1, GPIO PA interrupt flag byte 1
#define R8_INT_STATUS_PA_2                              (*((volatile uint8_t *)0x40400052))                         // RW1, GPIO PA interrupt flag byte 2
#define R32_INT_ENABLE_PA                               (*((volatile uint32_t *)0x40400054))                        // RW, GPIO PA interrupt enable
#define R8_INT_ENABLE_PA_1                              (*((volatile uint8_t *)0x40400055))                         // RW, GPIO PA interrupt enable byte 1
#define R8_INT_ENABLE_PA_2                              (*((volatile uint8_t *)0x40400056))                         // RW, GPIO PA interrupt enable byte 2
#define R32_INT_MODE_PA                                 (*((volatile uint32_t *)0x40400058))                        // RW, GPIO PA interrupt mode: 0=level action, 1=edge action
#define R8_INT_MODE_PA_1                                (*((volatile uint8_t *)0x40400059))                         // RW, GPIO PA interrupt mode byte 1
#define R8_INT_MODE_PA_2                                (*((volatile uint8_t *)0x4040005A))                         // RW, GPIO PA interrupt mode byte 2
#define R32_INT_POLAR_PA                                (*((volatile uint32_t *)0x4040005C))                        // RW, GPIO PA interrupt polarity: 0=normal/low level/fall edge, 1=invert/high level/rise edge
#define R8_INT_POLAR_PA_1                               (*((volatile uint8_t *)0x4040005D))                         // RW, GPIO PA interrupt polarity byte 1
#define R8_INT_POLAR_PA_2                               (*((volatile uint8_t *)0x4040005E))                         // RW, GPIO PA interrupt polarity byte 2

/* GPIO PB interrupt register */                        
#define R32_INT_STATUS_PB                               (*((volatile uint32_t *)0x40400060))                        // RW1, GPIO PB interrupt flag
#define R8_INT_STATUS_PB_0                              (*((volatile uint8_t *)0x40400060))                         // RW1, GPIO PB interrupt flag byte 0
#define R8_INT_STATUS_PB_1                              (*((volatile uint8_t *)0x40400061))                         // RW1, GPIO PB interrupt flag byte 1
#define R8_INT_STATUS_PB_2                              (*((volatile uint8_t *)0x40400062))                         // RW1, GPIO PB interrupt flag byte 2
#define R32_INT_ENABLE_PB                               (*((volatile uint32_t *)0x40400064))                        // RW, GPIO PB interrupt enable
#define R8_INT_ENABLE_PB_0                              (*((volatile uint8_t *)0x40400064))                         // RW, GPIO PB interrupt enable byte 0
#define R8_INT_ENABLE_PB_1                              (*((volatile uint8_t *)0x40400065))                         // RW, GPIO PB interrupt enable byte 1
#define R8_INT_ENABLE_PB_2                              (*((volatile uint8_t *)0x40400066))                         // RW, GPIO PB interrupt enable byte 2
#define R32_INT_MODE_PB                                 (*((volatile uint32_t *)0x40400068))                        // RW, GPIO PB interrupt mode: 0=level action, 1=edge action
#define R8_INT_MODE_PB_0                                (*((volatile uint8_t *)0x40400068))                         // RW, GPIO PB interrupt mode byte 0
#define R8_INT_MODE_PB_1                                (*((volatile uint8_t *)0x40400069))                         // RW, GPIO PB interrupt mode byte 1
#define R8_INT_MODE_PB_2                                (*((volatile uint8_t *)0x4040006A))                         // RW, GPIO PB interrupt mode byte 2
#define R32_INT_POLAR_PB                                (*((volatile uint32_t *)0x4040006C))                        // RW, GPIO PB interrupt polarity: 0=normal/low level/fall edge, 1=invert/high level/rise edge
#define R8_INT_POLAR_PB_0                               (*((volatile uint8_t *)0x4040006C))                         // RW, GPIO PB interrupt polarity byte 0
#define R8_INT_POLAR_PB_1                               (*((volatile uint8_t *)0x4040006D))                         // RW, GPIO PB interrupt polarity byte 1
#define R8_INT_POLAR_PB_2                               (*((volatile uint8_t *)0x4040006E))                         // RW, GPIO PB interrupt polarity byte 2

/* GPIO PD interrupt register */                        
#define R32_INT_STATUS_PD                               (*((volatile uint32_t *)0x40400070))                        // RW1, GPIO PD interrupt flag
#define R8_INT_STATUS_PD_0                              (*((volatile uint8_t *)0x40400070))                         // RW1, GPIO PD interrupt flag byte 0
#define R8_INT_STATUS_PD_3                              (*((volatile uint8_t *)0x40400073))                         // RW1, GPIO PD interrupt flag byte 3
#define R32_INT_ENABLE_PD                               (*((volatile uint32_t *)0x40400074))                        // RW, GPIO PD interrupt enable
#define R8_INT_ENABLE_PD_0                              (*((volatile uint8_t *)0x40400074))                         // RW, GPIO PD interrupt enable byte 0
#define R8_INT_ENABLE_PD_3                              (*((volatile uint8_t *)0x40400077))                         // RW, GPIO PD interrupt enable byte 3
#define R32_INT_MODE_PD                                 (*((volatile uint32_t *)0x40400078))                        // RW, GPIO PD interrupt mode: 0=level action, 1=edge action
#define R8_INT_MODE_PD_0                                (*((volatile uint8_t *)0x40400078))                         // RW, GPIO PD interrupt mode byte 0
#define R8_INT_MODE_PD_3                                (*((volatile uint8_t *)0x4040007B))                         // RW, GPIO PD interrupt mode byte 3
#define R32_INT_POLAR_PD                                (*((volatile uint32_t *)0x4040007C))                        // RW, GPIO PD interrupt polarity: 0=normal/low level/fall edge, 1=invert/high level/rise edge
#define R8_INT_POLAR_PD_0                               (*((volatile uint8_t *)0x4040007C))                         // RW, GPIO PD interrupt polarity byte 0
#define R8_INT_POLAR_PD_3                               (*((volatile uint8_t *)0x4040007F))                         // RW, GPIO PD interrupt polarity byte 3

/* GPIO interrupt register address offset and bit define */                     
#define BA_INT_PA                                       ((volatile uint8_t *)0x40400050)                            // point GPIO PA interrupt base address
#define BA_INT_PB                                       ((volatile uint8_t *)0x40400060)                            // point GPIO PB interrupt base address
#define BA_INT_PD                                       ((volatile uint8_t *)0x40400070)                            // point GPIO PD interrupt base address
#define INT_GPIO_STATUS                                 0x00
#define INT_GPIO_STATUS_0                               0x00
#define INT_GPIO_STATUS_1                               0x01
#define INT_GPIO_STATUS_2                               0x02
#define INT_GPIO_ENABLE                                 0x04
#define INT_GPIO_ENABLE_0                               0x04
#define INT_GPIO_ENABLE_1                               0x05
#define INT_GPIO_ENABLE_2                               0x06
#define INT_GPIO_MODE                                   0x08
#define INT_GPIO_MODE_0                                 0x08
#define INT_GPIO_MODE_1                                 0x09
#define INT_GPIO_MODE_2                                 0x0A
#define INT_GPIO_POLAR                                  0x0C
#define INT_GPIO_POLAR_0                                0x0C
#define INT_GPIO_POLAR_1                                0x0D
#define INT_GPIO_POLAR_2                                0x0E

/* GPIO PA register */
#define R32_PA_DIR                                      (*((volatile uint32_t *)0x40400080))                        // RW, GPIO PA I/O direction: 0=in, 1=out
#define R8_PA_DIR_0                                     (*((volatile uint8_t *)0x40400080))                         // RW, GPIO PA I/O direction byte 0
#define R8_PA_DIR_1                                     (*((volatile uint8_t *)0x40400081))                         // RW, GPIO PA I/O direction byte 1
#define R8_PA_DIR_2                                     (*((volatile uint8_t *)0x40400082))                         // RW, GPIO PA I/O direction byte 2
#define R32_PA_PIN                                      (*((volatile uint32_t *)0x40400084))                        // RO, GPIO PA input
#define R8_PA_PIN_0                                     (*((volatile uint8_t *)0x40400084))                         // RO, GPIO PA input byte 0
#define R8_PA_PIN_1                                     (*((volatile uint8_t *)0x40400085))                         // RO, GPIO PA input byte 1
#define R8_PA_PIN_2                                     (*((volatile uint8_t *)0x40400086))                         // RO, GPIO PA input byte 2
#define R32_PA_OUT                                      (*((volatile uint32_t *)0x40400088))                        // RW, GPIO PA output
#define R8_PA_OUT_0                                     (*((volatile uint8_t *)0x40400088))                         // RW, GPIO PA output byte 0
#define R8_PA_OUT_1                                     (*((volatile uint8_t *)0x40400089))                         // RW, GPIO PA output byte 1
#define R8_PA_OUT_2                                     (*((volatile uint8_t *)0x4040008A))                         // RW, GPIO PA output byte 2
#define R32_PA_CLR                                      (*((volatile uint32_t *)0x4040008C))                        // WZ, GPIO PA clear output: 0=keep, 1=clear
#define R8_PA_CLR_0                                     (*((volatile uint8_t *)0x4040008C))                         // WZ, GPIO PA clear output byte 0
#define R8_PA_CLR_1                                     (*((volatile uint8_t *)0x4040008D))                         // WZ, GPIO PA clear output byte 1
#define R8_PA_CLR_2                                     (*((volatile uint8_t *)0x4040008E))                         // WZ, GPIO PA clear output byte 2
#define R32_PA_PU                                       (*((volatile uint32_t *)0x40400090))                        // RW, GPIO PA pullup resistance enable
#define R8_PA_PU_0                                      (*((volatile uint8_t *)0x40400090))                         // RW, GPIO PA pullup resistance enable byte 0
#define R8_PA_PU_1                                      (*((volatile uint8_t *)0x40400091))                         // RW, GPIO PA pullup resistance enable byte 1
#define R8_PA_PU_2                                      (*((volatile uint8_t *)0x40400092))                         // RW, GPIO PA pullup resistance enable byte 2
#define R32_PA_PD                                       (*((volatile uint32_t *)0x40400094))                        // RW, GPIO PA output open-drain & input pulldown resistance enable
#define R8_PA_PD_0                                      (*((volatile uint8_t *)0x40400094))                         // RW, GPIO PA output open-drain & input pulldown resistance enable byte 0
#define R8_PA_PD_1                                      (*((volatile uint8_t *)0x40400095))                         // RW, GPIO PA output open-drain & input pulldown resistance enable byte 1
#define R8_PA_PD_2                                      (*((volatile uint8_t *)0x40400096))                         // RW, GPIO PA output open-drain & input pulldown resistance enable byte 2

/* GPIO PB register */                      
#define R32_PB_DIR                                      (*((volatile uint32_t *)0x404000A0))                        // RW, GPIO PB I/O direction: 0=in, 1=out
#define R8_PB_DIR_0                                     (*((volatile uint8_t *)0x404000A0))                         // RW, GPIO PB I/O direction byte 0
#define R8_PB_DIR_1                                     (*((volatile uint8_t *)0x404000A1))                         // RW, GPIO PB I/O direction byte 1
#define R8_PB_DIR_2                                     (*((volatile uint8_t *)0x404000A2))                         // RW, GPIO PB I/O direction byte 2
#define R32_PB_PIN                                      (*((volatile uint32_t *)0x404000A4))                        // RO, GPIO PB input
#define R8_PB_PIN_0                                     (*((volatile uint8_t *)0x404000A4))                         // RO, GPIO PB input byte 0
#define R8_PB_PIN_1                                     (*((volatile uint8_t *)0x404000A5))                         // RO, GPIO PB input byte 1
#define R8_PB_PIN_2                                     (*((volatile uint8_t *)0x404000A6))                         // RO, GPIO PB input byte 2
#define R32_PB_OUT                                      (*((volatile uint32_t *)0x404000A8))                        // RW, GPIO PB output
#define R8_PB_OUT_0                                     (*((volatile uint8_t *)0x404000A8))                         // RW, GPIO PB output byte 0
#define R8_PB_OUT_1                                     (*((volatile uint8_t *)0x404000A9))                         // RW, GPIO PB output byte 1
#define R8_PB_OUT_2                                     (*((volatile uint8_t *)0x404000AA))                         // RW, GPIO PB output byte 2
#define R32_PB_CLR                                      (*((volatile uint32_t *)0x404000AC))                        // WZ, GPIO PB clear output: 0=keep, 1=clear
#define R8_PB_CLR_0                                     (*((volatile uint8_t *)0x404000AC))                         // WZ, GPIO PB clear output byte 0
#define R8_PB_CLR_1                                     (*((volatile uint8_t *)0x404000AD))                         // WZ, GPIO PB clear output byte 1
#define R8_PB_CLR_2                                     (*((volatile uint8_t *)0x404000AE))                         // WZ, GPIO PB clear output byte 2
#define R32_PB_PU                                       (*((volatile uint32_t *)0x404000B0))                        // RW, GPIO PB pullup resistance enable
#define R8_PB_PU_0                                      (*((volatile uint8_t *)0x404000B0))                         // RW, GPIO PB pullup resistance enable byte 0
#define R8_PB_PU_1                                      (*((volatile uint8_t *)0x404000B1))                         // RW, GPIO PB pullup resistance enable byte 1
#define R8_PB_PU_2                                      (*((volatile uint8_t *)0x404000B2))                         // RW, GPIO PB pullup resistance enable byte 2
#define R32_PB_PD                                       (*((volatile uint32_t *)0x404000B4))                        // RW, GPIO PB output open-drain & input pulldown resistance enable
#define R8_PB_PD_0                                      (*((volatile uint8_t *)0x404000B4))                         // RW, GPIO PB output open-drain & input pulldown resistance enable byte 0
#define R8_PB_PD_1                                      (*((volatile uint8_t *)0x404000B5))                         // RW, GPIO PB output open-drain & input pulldown resistance enable byte 1
#define R8_PB_PD_2                                      (*((volatile uint8_t *)0x404000B6))                         // RW, GPIO PB output open-drain & input pulldown resistance enable byte 2

/* GPIO PD register */                      
#define R32_PD_DIR                                      (*((volatile uint32_t *)0x404000C0))                        // RW, GPIO PD I/O direction: 0=in, 1=out
#define R8_PD_DIR_0                                     (*((volatile uint8_t *)0x404000C0))                         // RW, GPIO PD I/O direction byte 0
#define R8_PD_DIR_1                                     (*((volatile uint8_t *)0x404000C1))                         // RW, GPIO PD I/O direction byte 1
#define R8_PD_DIR_2                                     (*((volatile uint8_t *)0x404000C2))                         // RW, GPIO PD I/O direction byte 2
#define R8_PD_DIR_3                                     (*((volatile uint8_t *)0x404000C3))                         // RW, GPIO PD I/O direction byte 3
#define R32_PD_PIN                                      (*((volatile uint32_t *)0x404000C4))                        // RO, GPIO PD input
#define R8_PD_PIN_0                                     (*((volatile uint8_t *)0x404000C4))                         // RO, GPIO PD input byte 0
#define R8_PD_PIN_1                                     (*((volatile uint8_t *)0x404000C5))                         // RO, GPIO PD input byte 1
#define R8_PD_PIN_2                                     (*((volatile uint8_t *)0x404000C6))                         // RO, GPIO PD input byte 2
#define R8_PD_PIN_3                                     (*((volatile uint8_t *)0x404000C7))                         // RO, GPIO PD input byte 3
#define R32_PD_OUT                                      (*((volatile uint32_t *)0x404000C8))                        // RW, GPIO PD output
#define R8_PD_OUT_0                                     (*((volatile uint8_t *)0x404000C8))                         // RW, GPIO PD output byte 0
#define R8_PD_OUT_1                                     (*((volatile uint8_t *)0x404000C9))                         // RW, GPIO PD output byte 1
#define R8_PD_OUT_2                                     (*((volatile uint8_t *)0x404000CA))                         // RW, GPIO PD output byte 2
#define R8_PD_OUT_3                                     (*((volatile uint8_t *)0x404000CB))                         // RW, GPIO PD output byte 3
#define R32_PD_PU                                       (*((volatile uint32_t *)0x404000D0))                        // RW, GPIO PD pullup resistance enable
#define R8_PD_PU_0                                      (*((volatile uint8_t *)0x404000D0))                         // RW, GPIO PD pullup resistance enable 0
#define R8_PD_PU_1                                      (*((volatile uint8_t *)0x404000D1))                         // RW, GPIO PD pullup resistance enable 1
#define R8_PD_PU_2                                      (*((volatile uint8_t *)0x404000D2))                         // RW, GPIO PD pullup resistance enable 2
#define R8_PD_PU_3                                      (*((volatile uint8_t *)0x404000D3))                         // RW, GPIO PD pullup resistance enable 3
#define R32_PD_PD                                       (*((volatile uint32_t *)0x404000D4))                        // RW, GPIO PD pulldown resistance enable
#define R8_PD_PD_0                                      (*((volatile uint8_t *)0x404000D4))                         // RW, GPIO PD pulldown resistance enable 0
#define R8_PD_PD_1                                      (*((volatile uint8_t *)0x404000D5))                         // RW, GPIO PD pulldown resistance enable 1
#define R8_PD_PD_2                                      (*((volatile uint8_t *)0x404000D6))                         // RW, GPIO PD pulldown resistance enable 2
#define R8_PD_PD_3                                      (*((volatile uint8_t *)0x404000D7))                         // RW, GPIO PD pulldown resistance enable 3

/* GPIO register address offset and bit define */
#define BA_PA                                           ((volatile uint8_t *)0x40400080)                            // point GPIO PA base address
#define BA_PB                                           ((volatile uint8_t *)0x404000A0)                            // point GPIO PB base address
#define BA_PD                                           ((volatile uint8_t *)0x404000C0)                            // point GPIO PD base address
#define GPIO_DIR                                        0x00
#define GPIO_DIR_0                                      0x00
#define GPIO_DIR_1                                      0x01
#define GPIO_DIR_2                                      0x02
#define GPIO_DIR_3                                      0x03
#define GPIO_PIN                                        0x04
#define GPIO_PIN_0                                      0x04
#define GPIO_PIN_1                                      0x05
#define GPIO_PIN_2                                      0x06
#define GPIO_PIN_3                                      0x07
#define GPIO_OUT                                        0x08
#define GPIO_OUT_0                                      0x08
#define GPIO_OUT_1                                      0x09
#define GPIO_OUT_2                                      0x0A
#define GPIO_OUT_3                                      0x0B
#define GPIO_CLR                                        0x0C
#define GPIO_CLR_0                                      0x0C
#define GPIO_CLR_1                                      0x0D
#define GPIO_CLR_2                                      0x0E
#define GPIO_CLR_3                                      0x0F
#define GPIO_PU                                         0x10
#define GPIO_PU_0                                       0x10
#define GPIO_PU_1                                       0x11
#define GPIO_PU_2                                       0x12
#define GPIO_PU_3                                       0x13
#define GPIO_PD                                         0x14
#define GPIO_PD_0                                       0x14
#define GPIO_PD_1                                       0x15
#define GPIO_PD_2                                       0x16
#define GPIO_PD_3                                       0x17
#define RB_PD_15_8                                      0x01                                                        // RW, GPIO PD[15:8] pullup resistance enable together
#define RB_PD_23_16                                     0x01                                                        // RW, GPIO PD[23:16] pullup resistance enable together
#define RB_PD_31_24                                     0x01                                                        // RW, GPIO PD[31:24] pullup resistance enable together

