openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564.h
/*AF remap and debug I/O configuration register (AFIO_PCFR1)*/
#define R32_AFIO_PCFR1                                  (*((volatile uint32_t *)0x40400140))                        //AF remap and debug I/O configuration register (AFIO_PCFR1)
#define MASK_LINK_LED_RM                                0xc0000000                                                  //LINK LED remapping
#define MASK_SLV_RW_RM                                  0x30000000                                                  //SLV remapping
#define MASK_SLV_DATA_RM                                0x0c000000                                                  //SLV data remapping
#define MASK_SLV_ADDR1_RM                               0x03000000                                                  //SLV address1 remapping
#define MASK_SLV_ADDR_RM                                0x00c00000                                                  //SLV command data selection input pin remapping
#define MASK_SLV_CS_RM                                  0x00300000                                                  //SLV piece selection pin remapping
#define MASK_SLV_INTERRUPT_RM                           0x000c0000                                                  //SLV interrupt pin remapping
#define MASK_I2C_RM                                     0x00030000                                                  //I2C remapping
#define MASK_UART2_MODEM_RM                             0x0000c000                                                  //UART2 MODEM remapping
#define MASK_UART1_MODEM_RM                             0x00003000                                                  //UART1 MODEM remapping
#define MASK_UART0_MODEM_RM                             0x00000c00                                                  //UART0 MODEM remapping
#define MASK_UART3_RM                                   0x00000300                                                  //UART3 remapping
#define MASK_UART2_RM                                   0x000000c0                                                  //UART2 remapping
#define MASK_UART1_RM                                   0x00000030                                                  //UART1 remapping
#define MASK_UART0_RM                                   0x0000000c                                                  //UART0 remapping
#define MASK_SPI0_RM                                    0x00000003                                                  //SPI0 remapping
/*AF remap and debug I/O configuration register (AFIO_PCFR2)*/                  
#define R32_AFIO_PCFR2                                  (*((volatile uint32_t *)0x40400160))                        //AF remap and debug I/O configuration register (AFIO_PCFR2)
#define UART3_MODEM                                     0x000c0000                                                  //UART3 MODEM remapping
#define TNOW3_RM                                        0x00030000                                                  //TNOW3 remapping
#define TNOW2_RM                                        0x0000c000                                                  //TNOW2 remapping
#define TNOW1_RM                                        0x00003000                                                  //TNOW1 remapping
#define TNOW0_RM                                        0x00000c00                                                  //TNOW0 remapping
#define SPI1_RM                                         0x00000300                                                  //UART3 remapping
#define BUSY_RM                                         0x00000040                                                  //BUSY remapping
#define TIMER1_RM                                       0x00000020                                                  //TIMER1 remapping
#define TIMER0_RM                                       0x00000010                                                  //TIMER0 remapping
#define RST_RM                                          0x0000000c                                                  //reset pin remapping
#define ACT_LED_RM                                      0x00000003                                                  //active led remapping
                    
/*Configure the extended control register 0*/                   
#define R32_EXTEN_CTLR0                                 (*((volatile uint32_t *)0x40400144))                        //Configure the extended control register 0
#define RB_CORE_PROT_STATUS                             0x40000000                                                  //Core protected moed status bit
#define RB_CORE_HALT_INT_EN                             0x02000000                                                  //Kernel error interrupt enabled
#define RB_RST_DLEAY_EN                                 0x01000000                                                  //reset time extension control bit
#define RB_XI_STATUS                                    0x00800000                                                  //XI STATUS
#define RB_USBPLLON                                     0x00400000                                                  //USBPLL clock enable bit
#define RB_FLASH_PRE_EN                                 0x00200000                                                  //flash clock pre-divisor enable
#define RB_ETHRST                                       0x00080000                                                  //ethernet reset control
#define RB_DIG_ETH_PHY_RST                              0x00020000                                                  //ethernet phy digital module reset control
#define RB_ANA_ETH_PHY_RST                              0x00010000                                                  //ethernet phy analog module reset control
#define RB_USBPLLCLK                                    0x0000c000                                                  //USBPLL input clock frequency selection
#define RB_RST_CMD_EN                                   0x00002000                                                  //global reset enabled
#define RB_BUSY_EN                                      0x00001000                                                  //the busy signal output of spi and slv enabled
#define RB_TNOW3_EN                                     0x00000800                                                  //the TNOW signal output of the UART3 is enabled
#define RB_TNOW2_EN                                     0x00000400                                                  //the TNOW signal output of the UART2 is enabled
#define RB_TNOW1_EN                                     0x00000200                                                  //the TNOW signal output of the UART1 is enabled
#define RB_TNOW0_EN                                     0x00000100                                                  //the TNOW signal output of the UART0 is enabled
#define RB_SW                                           0x00000080                                                  //select the systemitem clock source
#define RB_USBPLLSRC                                    0x00000060                                                  //USBPLL reference clock source
#define RB_SW_CFG                                       0x00000001                                                  //Serial wire JTAG configuration
/*Configure the extended control register 1*/                   
#define R32_EXTEN_CTLR1                                 (*((volatile uint32_t *)0x40400154))                        //Configure the extended control register 1
#define RB_VIO_PWN_INT_EN                               0x00800000                                                  //Enables an outage when the VIO power is down
#define RB_VIO_PWN_RST_EN                               0x00400000                                                  //Enable system reset when the VIO power is down
#define RB_VIO_PWN_IO_EN                                0x00200000                                                  //Enable the IO port of the peripheral to input a high levelwhen the VIO power is down
#define RB_LDO_SLP_EN                                   0x00100000                                                  //Enable the LDO to go into sleep mode when the VIO power isdown
#define RB_CLKSEL                                       0x00080000                                                  //Clock signal selection
#define RB_HSE_STATUS                                   0x00008000                                                  //External crystal current level status
#define RB_VIO_RDY                                      0x00000080                                                  //VIO status
#define RB_HSION                                        0x00000040                                                  //Internal High Speed clock enable
#define RB_HSEON                                        0x00000020                                                  //External High Speed clock enable
/*Configure the extended control register 2*/                   
#define R32_EXTEN_CTLR2                                 (*((volatile uint32_t *)0x4040016c))                        //Configure the extended control register 2
#define RB_XIXO_GPIO_EN                                 0x02000000                                                  //XI/XO pin open-drain_ouput control bit
#define RB_XO_OE                                        0x01000000                                                  //XO ouput enable bit
#define RB_XI_OE                                        0x00800000                                                  //XI ouput enable bit
#define RB_USBPD_IN_HVT1                                0x00000002                                                  //PD PIN PB19 high threshold input mode
#define RB_USBPD_IN_HVT0                                0x00000001                                                  //PD PIN PB18 high threshold input mode
                    
