openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564.h
/*flash data manipulation register */                   
#define R8_SPI_FLASH_DATA                               (*((volatile uint8_t *)0x40400018))                         //flash data manipulation register
/*Flash control register*/                  
#define R8_SPI_FLASH_CTRL                               (*((volatile uint8_t *)0x4040001a))                         //Flash control register
#define RB_FLASH_RD_EN                                  0x04                                                        //The software reads the FLASH function enable bit
#define RB_FLASH_OE                                     0x02                                                        //Flash output enable
#define RB_FLASH_CS                                     0x01                                                        //Flash slice bit selection was enabled
/*CodeFlash key buffer register*/                   
#define R16_FLASHA_KEY_BUF                              (*((volatile uint16_t *)0x40400168))                        //CodeFlash key buffer register
#define R16_FLASHB_KEY_BUF                              (*((volatile uint16_t *)0x4040016A))                        //CodeFlash key buffer register

/* GPIO alias name */
#define TWP0                                            (1 << 4)                                                    // PA4
#define TWP1                                            (1 << 5)                                                    // PA5
#define TACK                                            (1 << 6)                                                    // PA6
#define TDO                                             (1 << 7)                                                    // PA7
#define TRST                                            (1 << 9)                                                    // PA9
#define TDI                                             (1 << 13)                                                   // PA13
#define TCK                                             (1 << 14)                                                   // PA14
#define TMS                                             (1 << 15)                                                   // PA15
#define UID                                             (1 << 8)                                                    // PA8
#define SLVI                                            (1 << 9)                                                    // PA9
#define PIN_PARA_A0                                     (1 << 10)                                                   // PA10
#define PIN_PARA_PCS                                    (1 << 11)                                                   // PA11
#define TNOW0                                           (1 << 7)                                                    // PA7
#define DTR0                                            (1 << 7)                                                    // PA7
#define RTS0                                            (1 << 8)                                                    // PA8
#define CTS0                                            (1 << 12)                                                   // PA12
#define DSR0                                            (1 << 13)                                                   // PA13
#define RI0                                             (1 << 14)                                                   // PA14
#define DCD0                                            (1 << 15)                                                   // PA15
#define CTS1                                            (1 << 16)                                                   // PA16
#define RTS1                                            (1 << 17)                                                   // PA17
#define TNOW1                                           (1 << 17)                                                   // PA17
#define ELED                                            (1 << 13)                                                   // PA13
#define ELINK                                           (1 << 18)                                                   // PA18
#define VBUS                                            (1 << 19)                                                   // PA19
#define PRD                                             (1 << 20)                                                   // PA20
#define PIN_PARA_RD                                     (1 << 20)                   
#define PWR_314                                         (1 << 21)                                                   // PA21
#define PIN_PARA_WR                                     (1 << 21)                   
#define CTS0X                                           (1 << 0)                                                    // PB0
#define DSR0X                                           (1 << 1)                                                    // PB1
#define RI0X                                            (1 << 2)                                                    // PB2
#define DCD0X                                           (1 << 3)                                                    // PB3
#define DTR0X                                           (1 << 4)                                                    // PB4
#define RTS0X                                           (1 << 5)                                                    // PB5
#define TRAN0                                           (1 << 0)                                                    // PB0
#define RECV0                                           (1 << 1)                                                    // PB1
#define TRAN1                                           (1 << 2)                                                    // PB2
#define RECV1                                           (1 << 3)                                                    // PB3
#define PWM0                                            (1 << 0)                                                    // PB0
#define CAT0                                            (1 << 1)                                                    // PB1
/* note: PB1/CAT0 will input from PECL if RB_MISC_PECL_EN=1 and TMR0.RB_TMR_OUT_EN=1 */                 
#define PWM1                                            (1 << 2)                                                    // PB2
#define CAT1                                            (1 << 3)                                                    // PB3
#define PWM2                                            (1 << 4)                                                    // PB4
#define CAT2                                            (1 << 5)                                                    // PB5
#define PWM3                                            (1 << 6)                                                    // PB6
#define CAT3                                            (1 << 6)                                                    // PB6
#define RXD0                                            (1 << 8)                                                    // PB8
#define TXD0                                            (1 << 9)                                                    // PB9
#define RXD1                                            (1 << 10)                                                   // PB10
/* note: PB10/RXD1 will input from PECL if RB_MISC_PECL_EN=1 and TMR0.RB_TMR_OUT_EN=0 */                    
#define RXTX1                                           (1 << 10)                                                   // PB10
#define TXD1                                            (1 << 11)                                                   // PB11
                    
#define SCS                                             (1 << 12)                                                   // PB12
#define SCK0                                            (1 << 13)                                                   // PB13
#define MOSI                                            (1 << 14)                                                   // PB14
#define MISO                                            (1 << 15)                                                   // PB15
#define SDX0                                            (1 << 15)                                                   // PB15
#define ADCS                                            (1 << 16)                                                   // PB16
#define SCK1                                            (1 << 17)                                                   // PB17
#define SDO                                             (1 << 18)                                                   // PB18
#define SDI                                             (1 << 19)                                                   // PB19
#define SDX1                                            (1 << 19)                                                   // PB19
#define RXD2                                            (1 << 28)                                                   // PD28
#define TXD2                                            (1 << 29)                                                   // PD29
#define RXD3                                            (1 << 22)                                                   // PD22
#define TXD3                                            (1 << 23)

