openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564.h
/* ADC register */
#define R32_ADC_CONTROL                                 (*((volatile uint32_t *)0x4040A000))                        // RW, ADC control
#define R8_ADC_CTRL_MOD                                 (*((volatile uint8_t *)0x4040A000))                         // RW, ADC mode control
#define R8_ADC_CTRL_DMA                                 (*((volatile uint8_t *)0x4040A001))                         // RW, ADC DMA control and etc.
#define R8_ADC_INTER_EN                                 (*((volatile uint8_t *)0x4040A002))                         // RW, ADC interrupt enable
#define R8_ADC_CLOCK_DIV                                (*((volatile uint8_t *)0x4040A003))                         // RW, ADC clock divisor
#define R32_ADC_STATUS                                  (*((volatile uint32_t *)0x4040A004))                        // RW, ADC status
#define R16_ADC_DATA                                    (*((volatile uint16_t *)0x4040A004))                        // RO, ADC result data
#define R8_ADC_INT_FLAG                                 (*((volatile uint8_t *)0x4040A006))                         // RW1, ADC interrupt flag
#define R8_ADC_FIFO_COUNT                               (*((volatile uint8_t *)0x4040A007))                         // RO, ADC FIFO count status
#define R32_ADC_CTRL                                    (*((volatile uint8_t *)0x4040A008))                         // RO, ADC control register
#define R16_ADC_CMP_VALUE                               (*((volatile uint16_t *)0x4040A00C))                        // RW, ADC comparison reference value
#define R16_ADC_FIFO                                    (*((volatile uint16_t *)0x4040A010))                        // RO, ADC FIFO register
#define R32_ADC_DMA_NOW                                 (*((volatile uint32_t *)0x4040A014))                        // RW, ADC DMA current address
#define R32_ADC_DMA_BEG                                 (*((volatile uint32_t *)0x4040A018))                        // RW, ADC DMA begin address
#define R32_ADC_DMA_END                                 (*((volatile uint32_t *)0x4040A01C))                        // RW, ADC DMA end address

/* ADC register address offset and bit define */
#define ADC_FIFO_SIZE                                   8                                                           // ADC FIFO size (depth)
#define BA_ADC                                          ((volatile uint8_t *)0x4040A000)                            // point ADC base address
#define ADC_CTRL_MOD                                    0
#define RB_ADC_CYCLE_CLK                                0x0F                                                        // RW, ADC cycle bit mask (clock number): 0=manual sample, other=set cycle for auto sample
#define RB_ADC_CHAN_MOD                                 0x30                                                        // RW, ADC channel control mode: 00=0#, 01=1#, 10=2#, 11=auto flip 0#/1#
#define RB_ADC_SAMPLE_WID                               0x40                                                        // RW, ADC sample pulse width: 0=1 clock, 1=2 clock
#define RB_ADC_POWER_ON                                 0x80                                                        // RW, ADC module enable
#define ADC_CTRL_DMA                                    1
#define RB_ADC_DMA_ENABLE                               0x01                                                        // RW, ADC DMA enable
#define RB_ADC_DMA_BURST                                0x02                                                        // RW, ADC DMA burst enable
#define RB_ADC_DMA_LOOP                                 0x04                                                        // RW, ADC DMA address loop enable
#define RB_ADC_CHAN_OE                                  0x40                                                        // WO, ADC channel control output enable
#define RB_ADC_MAN_SAMPLE                               0x80                                                        // RW, ADC manual sample control, high action
#define ADC_INTER_EN                                    2
#define RB_ADC_IE_ADC_CMP                               0x01                                                        // RW, enable interrupt for current ADC comparison action
#define RB_ADC_IE_ADC_END                               0x02                                                        // RW, enable interrupt for current ADC end
#define RB_ADC_IE_FIFO_HF                               0x04                                                        // RW, enable interrupt for ADC FIFO half
#define RB_ADC_IE_DMA_END                               0x08                                                        // RW, enable interrupt for ADC DMA completion
#define RB_ADC_IE_FIFO_OV                               0x10                                                        // RW, enable interrupt for ADC FIFO overflow
#define RB_ADC_IE_DMA_ERR                               0x20                                                        // RW, enable interrupt for ADC DMA respond error
#define RB_ADC_CMP_MOD_EQ                               0x40                                                        // RW, ADC equal comparison enable: 0=exclude equal, 1=include equal
#define RB_ADC_CMP_MOD_GT                               0x80                                                        // RW, ADC comparison mode: 0=less action, 1=great action
#define ADC_CLOCK_DIV                                   3
#define ADC_DATA                                        4
#define ADC_INT_FLAG                                    6
#define RB_ADC_IF_ADC_CMP                               0x01                                                        // RW1, interrupt flag for current ADC comparison action
#define RB_ADC_IF_ADC_END                               0x02                                                        // RW1, interrupt flag for current ADC end
#define RB_ADC_IF_FIFO_HF                               0x04                                                        // RW1, interrupt flag for ADC FIFO half
#define RB_ADC_IF_DMA_END                               0x08                                                        // RW1, interrupt flag for ADC DMA completion
#define RB_ADC_IF_FIFO_OV                               0x10                                                        // RW1, interrupt flag for ADC FIFO overflow
#define RB_ADC_IF_DMA_ERR                               0x20                                                        // RW1, interrupt flag for ADC DMA respond error
#define RB_ADC_EOC_FLAG                                 0x40                                                        // RO, current ADC converter end indicator
#define RB_ADC_CHAN_INDEX                               0x80                                                        // RO, current ADC channel number for auto flip: 0=0#/2#, 1=1#
#define ADC_FIFO_COUNT                                  7
#define ADC_CTRL                                        8
#define MASK_ADC_CTL_MOD1                               0x0000000f                                                  //Corresponding channel
#define MASK_ADC_SMAPLE_TIME                            0x01fffff0                                                  //ADC sampling and calibration time
#define MASK_ADC_CYCLE_BIT_4_6                          0x0e000000                                                  //Position 4-6 of the automatic sampling period
#define MASK_ADC_BIT_MODE                               0x10000000                                                  //ADC resolution selection bit
#define ADC_CMP_VALUE                                   0x0C
#define ADC_FIFO                                        0x10
#define MASK_ADC_DMA_ADDR                               0x0003ffff

/* UART0 register */
#define R8_UART0_RBR                                    (*((volatile uint8_t *)0x4040D000))                         // RO, UART0 receiver buffer, receiving byte
#define R8_UART0_THR                                    (*((volatile uint8_t *)0x4040D000))                         // WO, UART0 transmitter holding, transmittal byte
#define R8_UART0_IER                                    (*((volatile uint8_t *)0x4040D001))                         // RW, UART0 interrupt enable
#define R8_UART0_IIR                                    (*((volatile uint8_t *)0x4040D002))                         // RO, UART0 interrupt identification
#define R8_UART0_FCR                                    (*((volatile uint8_t *)0x4040D002))                         // WO, UART0 FIFO control
#define R8_UART0_LCR                                    (*((volatile uint8_t *)0x4040D003))                         // RW, UART0 line control
#define R8_UART0_MCR                                    (*((volatile uint8_t *)0x4040D004))                         // RW, UART0 modem control
#define R8_UART0_LSR                                    (*((volatile uint8_t *)0x4040D005))                         // RO, UART0 line status
#define R8_UART0_MSR                                    (*((volatile uint8_t *)0x4040D006))                         // RO, UART0 modem status
#define R8_UART0_DIV                                    (*((volatile uint8_t *)0x4040D007))                         // RW, UART0 pre-divisor latch byte, only low 7 bit, from 1 to 0/128
#define R8_UART0_DMA_CTRL                               (*((volatile uint8_t *)0x4040d008))                         // RW, DMA Control register
#define R8_UART0_DMA_IF                                 (*((volatile uint8_t *)0x4040d009))                         // RW, DMA status register
#define R32_UART0_DMA_WR_NOW_ADDR                       (*((volatile uint32_t *)0x4040d00c))                        //DMA receive mode current address register
#define R32_UART0_DMA_WR_START_ADDR                     (*((volatile uint32_t *)0x4040d010))                        //DMA receive mode start address register
#define R32_UART0_DMA_WR_END_ADDR                       (*((volatile uint32_t *)0x4040d014))                        //DMA received mode end address register
#define R32_UART0_DMA_RD_NOW_ADDR                       (*((volatile uint32_t *)0x4040d018))                        //DMA send mode current address register
#define R32_UART0_DMA_RD_START_ADDR                     (*((volatile uint32_t *)0x4040d01c))                        //DMA send mode start address register
#define R32_UART0_DMA_RD_END_ADDR                       (*((volatile uint32_t *)0x4040d020))                        //DMA send mode end address register
#define R8_UART0_DLL                                    (*((volatile uint8_t *)0x4040D000))                         // RW, UART0 divisor latch LSB byte
#define R8_UART0_DLM                                    (*((volatile uint8_t *)0x4040D001))                         // RW, UART0 divisor latch MSB byte

/* UART1 register */
#define R8_UART1_RBR                                    (*((volatile uint8_t *)0x4040D800))                         // RO, UART1 receiver buffer, receiving byte
#define R8_UART1_THR                                    (*((volatile uint8_t *)0x4040D800))                         // WO, UART1 transmitter holding, transmittal byte
#define R8_UART1_IER                                    (*((volatile uint8_t *)0x4040D801))                         // RW, UART1 interrupt enable
#define R8_UART1_IIR                                    (*((volatile uint8_t *)0x4040D802))                         // RO, UART1 interrupt identification
#define R8_UART1_FCR                                    (*((volatile uint8_t *)0x4040D802))                         // WO, UART1 FIFO control
#define R8_UART1_LCR                                    (*((volatile uint8_t *)0x4040D803))                         // RW, UART1 line control
#define R8_UART1_MCR                                    (*((volatile uint8_t *)0x4040D804))                         // RW, UART1 modem control
#define R8_UART1_LSR                                    (*((volatile uint8_t *)0x4040D805))                         // RO, UART1 line status
#define R8_UART1_MSR                                    (*((volatile uint8_t *)0x4040D806))                         // RO, UART1 modem status
#define R8_UART1_DIV                                    (*((volatile uint8_t *)0x4040D807))                         // RW, UART1 pre-divisor latch byte, only low 7 bit, from 1 to 0/128
#define R8_UART1_DMA_CTRL                               (*((volatile uint8_t *)0x4040d808))                         // RW, DMA Control register
#define R8_UART1_DMA_IF                                 (*((volatile uint8_t *)0x4040d809))                         // RW, DMA status register
#define R32_UART1_DMA_WR_NOW_ADDR                       (*((volatile uint32_t *)0x4040d80c))                        //DMA receive mode current address register
#define R32_UART1_DMA_WR_START_ADDR                     (*((volatile uint32_t *)0x4040d810))                        //DMA receive mode start address register
#define R32_UART1_DMA_WR_END_ADDR                       (*((volatile uint32_t *)0x4040d814))                        //DMA received mode end address register
#define R32_UART1_DMA_RD_NOW_ADDR                       (*((volatile uint32_t *)0x4040d818))                        //DMA send mode current address register
#define R32_UART1_DMA_RD_START_ADDR                     (*((volatile uint32_t *)0x4040d81c))                        //DMA send mode start address register
#define R32_UART1_DMA_RD_END_ADDR                       (*((volatile uint32_t *)0x4040d820))                        //DMA send mode end address register
#define R8_UART1_DLL                                    (*((volatile uint8_t *)0x4040D800))                         // RW, UART1 divisor latch LSB byte
#define R8_UART1_DLM                                    (*((volatile uint8_t *)0x4040D801))                         // RW, UART1 divisor latch MSB byte

/* UART2 register */
#define R8_UART2_RBR                                    (*((volatile uint8_t *)0x40409000))                         // RO, UART2 receiver buffer, receiving byte
#define R8_UART2_THR                                    (*((volatile uint8_t *)0x40409000))                         // WO, UART2 transmitter holding, transmittal byte
#define R8_UART2_IER                                    (*((volatile uint8_t *)0x40409001))                         // RW, UART2 interrupt enable
#define R8_UART2_IIR                                    (*((volatile uint8_t *)0x40409002))                         // RO, UART2 interrupt identification
#define R8_UART2_FCR                                    (*((volatile uint8_t *)0x40409002))                         // WO, UART2 FIFO control
#define R8_UART2_LCR                                    (*((volatile uint8_t *)0x40409003))                         // RW, UART2 line control
#define R8_UART2_MCR                                    (*((volatile uint8_t *)0x40409004))                         // RW, UART2 modem control
#define R8_UART2_LSR                                    (*((volatile uint8_t *)0x40409005))                         // RO, UART2 line status
#define R8_UART2_MSR                                    (*((volatile uint8_t *)0x40409006))                         // RO, UART2 modem status
#define R8_UART2_DIV                                    (*((volatile uint8_t *)0x40409007))                         // RW, UART2 pre-divisor latch byte, only low 7 bit, from 1 to 0/128
#define R8_UART2_DMA_CTRL                               (*((volatile uint8_t *)0x40409008))                         // RW, DMA Control register
#define R8_UART2_DMA_IF                                 (*((volatile uint8_t *)0x40409009))                         // RW, DMA status register
#define R32_UART2_DMA_WR_NOW_ADDR                       (*((volatile uint32_t *)0x4040900c))                        //DMA receive mode current address register
#define R32_UART2_DMA_WR_START_ADDR                     (*((volatile uint32_t *)0x40409010))                        //DMA receive mode start address register
#define R32_UART2_DMA_WR_END_ADDR                       (*((volatile uint32_t *)0x40409014))                        //DMA received mode end address register
#define R32_UART2_DMA_RD_NOW_ADDR                       (*((volatile uint32_t *)0x40409018))                        //DMA send mode current address register
#define R32_UART2_DMA_RD_START_ADDR                     (*((volatile uint32_t *)0x4040901c))                        //DMA send mode start address register
#define R32_UART2_DMA_RD_END_ADDR                       (*((volatile uint32_t *)0x40409020))                        //DMA send mode end address register
#define R8_UART2_DLL                                    (*((volatile uint8_t *)0x40409000))                         // RW, UART2 divisor latch LSB byte
#define R8_UART2_DLM                                    (*((volatile uint8_t *)0x40409001))                         // RW, UART2 divisor latch MSB byte


