openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564.h
/* UART3 register */
#define R8_UART3_RBR                                    (*((volatile uint8_t *)0x40409800))                         // RO, UART3 receiver buffer, receiving byte
#define R8_UART3_THR                                    (*((volatile uint8_t *)0x40409800))                         // WO, UART3 transmitter holding, transmittal byte
#define R8_UART3_IER                                    (*((volatile uint8_t *)0x40409801))                         // RW, UART3 interrupt enable
#define R8_UART3_IIR                                    (*((volatile uint8_t *)0x40409802))                         // RO, UART3 interrupt identification
#define R8_UART3_FCR                                    (*((volatile uint8_t *)0x40409802))                         // WO, UART3 FIFO control
#define R8_UART3_LCR                                    (*((volatile uint8_t *)0x40409803))                         // RW, UART3 line control
#define R8_UART3_MCR                                    (*((volatile uint8_t *)0x40409804))                         // RW, UART3 modem control
#define R8_UART3_LSR                                    (*((volatile uint8_t *)0x40409805))                         // RO, UART3 line status
#define R8_UART3_MSR                                    (*((volatile uint8_t *)0x40409806))                         // RO, UART3 modem status
#define R8_UART3_DIV                                    (*((volatile uint8_t *)0x40409807))                         // RW, UART3 pre-divisor latch byte, only low 7 bit, from 1 to 0/128
#define R8_UART3_DMA_CTRL                               (*((volatile uint8_t *)0x40409808))                         // RW, DMA Control register
#define R8_UART3_DMA_IF                                 (*((volatile uint8_t *)0x40409809))                         // RW, DMA status register
#define R32_UART3_DMA_WR_NOW_ADDR                       (*((volatile uint32_t *)0x4040980c))                        //DMA receive mode current address register
#define R32_UART3_DMA_WR_START_ADDR                     (*((volatile uint32_t *)0x40409810))                        //DMA receive mode start address register
#define R32_UART3_DMA_WR_END_ADDR                       (*((volatile uint32_t *)0x40409814))                        //DMA received mode end address register
#define R32_UART3_DMA_RD_NOW_ADDR                       (*((volatile uint32_t *)0x40409818))                        //DMA send mode current address register
#define R32_UART3_DMA_RD_START_ADDR                     (*((volatile uint32_t *)0x4040981c))                        //DMA send mode start address register
#define R32_UART3_DMA_RD_END_ADDR                       (*((volatile uint32_t *)0x40409820))                        //DMA send mode end address register
#define R8_UART3_DLL                                    (*((volatile uint8_t *)0x40409800))                         // RW, UART3 divisor latch LSB byte
#define R8_UART3_DLM                                    (*((volatile uint8_t *)0x40409801))                         // RW, UART3 divisor latch MSB byte


/* UART register address offset and bit define */
#define UART_FIFO_SIZE                                  16                                                          // UART0 FIFO size (depth)
#define UART_RECV_RDY_SZ                                14                                                          // the max FIFO trigger level for UART0 receiver data available
#define BA_UART0                                        ((volatile uint8_t *)0x4040D000)                            // point UART0 base address
#define BA_UART1                                        ((volatile uint8_t *)0x4040D800)                            // point UART1 base address
#define BA_UART2                                        ((volatile uint8_t *)0x40409000)                            // point UART2 base address
#define BA_UART3                                        ((volatile uint8_t *)0x40409800)                            // point UART3 base address
#define UART_RBR                                        0
#define UART_THR                                        0
#define UART_IER                                        1
#define RB_IER_RECV_RDY                                 0x01                                                        // RW, UART interrupt enable for receiver data ready
#define RB_IER_THR_EMPTY                                0x02                                                        // RW, UART interrupt enable for THR empty
#define RB_IER_LINE_STAT                                0x04                                                        // RW, UART interrupt enable for receiver line status
#define RB_IER_MODEM_CHG                                0x08                                                        // RW, UART interrupt enable for modem status change
#define RB_IER_MODEM_IO                                 0x10                                                        // RW, UART0 modem pin selection: 0=from/to GPIO PA, 1=from/to GPIO PB
#define RB_IER_IRDA_MOD                                 0x10                                                        // RW, UART1 IrDA mode enable
#define RB_IER_MOUT_EN                                  0x20                                                        // RW, UART modem output pin enable
#define RB_IER_TXD_EN                                   0x40                                                        // RW, UART TXD pin enable
#define RB_IER_RESET                                    0x80                                                        // WZ, UART software reset control, high action, auto clear
#define UART_IIR                                        2                                   
#define RB_IIR_NO_INT                                   0x01                                                        // RO, UART no interrupt flag: 0=interrupt action, 1=no interrupt
#define RB_IIR_INT_MASK                                 0x0F                                                        // RO, UART interrupt flag bit mask
#define RB_IIR_FIFO_ID                                  0xC0                                                        // RO, UART FIFO enabled flag
#define UART_FCR                                        2                                   
#define RB_FCR_FIFO_EN                                  0x01                                                        // WO, UART FIFO enable
#define RB_FCR_RX_FIFO_CLR                              0x02                                                        // WZ, clear UART receiver FIFO, high action, auto clear
#define RB_FCR_TX_FIFO_CLR                              0x04                                                        // WZ, clear UART transmitter FIFO, high action, auto clear
#define RB_FCR_FIFO_TRIG                                0xC0                                                        // WO, UART0/1 receiver FIFO trigger level: 00-1byte, 01-4/8bytes, 10-8/16bytes, 11-14/28bytes
#define UART_LCR                                        3                                   
#define RB_LCR_WORD_SZ                                  0x03                                                        // RW, UART word bit length: 00-5bit, 01-6bit, 10-7bit, 11-8bit
#define RB_LCR_STOP_BIT                                 0x04                                                        // RW, UART stop bit length: 0-1bit, 1-2bit
#define RB_LCR_PAR_EN                                   0x08                                                        // RW, UART parity enable
#define RB_LCR_PAR_MOD                                  0x30                                                        // RW, UART pariry mode: 00-odd, 01-even, 10-mark, 11-space
#define RB_LCR_BREAK_EN                                 0x40                                                        // RW, UART break control enable
#define RB_LCR_DLAB                                     0x80                                                        // RW, UART divisor latch access bit
#define UART_MCR                                        4                                   
#define RB_MCR_DTR                                      0x01                                                        // RW, UART control DTR
#define RB_MCR_RTS                                      0x02                                                        // RW, UART control RTS
#define RB_MCR_OUT1                                     0x04                                                        // RW, UART control OUT1
#define RB_MCR_OUT2                                     0x08                                                        // RW, UART control OUT2
#define RB_MCR_LOOP                                     0x10                                                        // RW, UART0 enable local loop back
#define RB_MCR_RXTX                                     0x10                                                        // RW, UART1 enable RXTX for half-duplex (TXD auto three-state output on RXD pin)
#define RB_MCR_AU_FLOW_EN                               0x20                                                        // RW, UART enable autoflow control
#define RB_MCR_TNOW                                     0x40                                                        // RW, UART enable TNOW output on DTR or RTS pin
#define RB_MCR_HALF                                     0x80                                                        // RW, UART enable half-duplex
#define UART_LSR                                        5                                   
#define RB_LSR_DATA_RDY                                 0x01                                                        // RO, UART receiver fifo data ready status
#define RB_LSR_OVER_ERR                                 0x02                                                        // RZ, UART receiver overrun error
#define RB_LSR_PAR_ERR                                  0x04                                                        // RZ, UART receiver parity error
#define RB_LSR_FRAME_ERR                                0x08                                                        // RZ, UART receiver frame error
#define RB_LSR_BREAK_ERR                                0x10                                                        // RZ, UART receiver break error
#define RB_LSR_TX_FIFO_EMP                              0x20                                                        // RO, UART transmitter fifo empty status
#define RB_LSR_TX_ALL_EMP                               0x40                                                        // RO, UART transmitter all empty status
#define RB_LSR_ERR_RX_FIFO                              0x80                                                        // RO, error in UART receiver fifo
#define UART_MSR                                        6                                   
#define RB_MSR_CTS_CHG                                  0x01                                                        // RZ, UART CTS changed status, high action
#define RB_MSR_DSR_CHG                                  0x02                                                        // RZ, UART DSR changed status, high action
#define RB_MSR_RI_CHG                                   0x04                                                        // RZ, UART RI changed status, high action
#define RB_MSR_DCD_CHG                                  0x08                                                        // RZ, UART DCD changed status, high action
#define RB_MSR_CTS                                      0x10                                                        // RO, UART CTS action status
#define RB_MSR_DSR                                      0x20                                                        // RO, UART DSR action status
#define RB_MSR_RI                                       0x40                                                        // RO, UART RI action status
#define RB_MSR_DCD                                      0x80                                                        // RO, UART DCD action status
#define UART_ADR                                        7                                   
#define UART_DIV                                        7                                   
#define UART0_DMA_CTRL                                  8                                   
#define RB_DMA_WR_EN                                    0x01                                                        //DMA enabled when receiving data
#define RB_DMA_WR_LOOP_EN                               0x02                                                        //DMA loop mode enabled when receiving data
#define RB_DMA_WR_END_EN                                0x04                                                        //the end of DMA interrupt when receiving data is enabled
#define RB_DMA_RD_EN                                    0x10                                                        //DMA enabled when sending data
#define RB_DMA_RD_LOOP_EN                               0x20                                                        //DMA loop mode enabled when sending data
#define RB_DMA_RD_END_EN                                0x40                                                        //the end of DMA interrupt when sending data is enabled
#define UART0_DMA_IF                                    9                                   
#define RB_DMA_IF_PAR_ERR                               0x02                                                        //DMA parity error flag
#define RB_DMA_IF_TX_END                                0x04                                                        //DMA end flag when data is sended
#define RB_DMA_IF_FRAME_ERR                             0x02                                                        //DMA frame error flag
#define RB_DMA_IF_RX_END                                0x01                                                        //DMA end flag when data is received
#define UART_DLL                                        0                                   
#define UART_DLM                                        1                                   
#define MASK_UART_DMA_ADDR                              0x0003ffff                                  
                                    
/* UART interrupt identification values for IIR bits 3:0 */                                 
#define UART_II_SLV_ADDR                                0x0E                                                        // RO, UART1 slave address match
#define UART_II_LINE_STAT                               0x06                                                        // RO, UART interrupt by receiver line status
#define UART_II_RECV_RDY                                0x04                                                        // RO, UART interrupt by receiver data available
#define UART_II_RECV_TOUT                               0x0C                                                        // RO, UART interrupt by receiver fifo timeout
#define UART_II_THR_EMPTY                               0x02                                                        // RO, UART interrupt by THR empty
#define UART_II_MODEM_CHG                               0x00                                                        // RO, UART interrupt by modem status change
#define UART_II_NO_INTER                                0x01                                                        // RO, no UART interrupt is pending

/* SPI0 register */
#define R32_SPI0_CONTROL                                (*((volatile uint32_t *)0x4040C000))                        // RW, SPI0 control
#define R8_SPI0_CTRL_MOD                                (*((volatile uint8_t *)0x4040C000))                         // RW, SPI0 mode control
#define R8_SPI0_CTRL_DMA                                (*((volatile uint8_t *)0x4040C001))                         // RW, SPI0 DMA control
#define R8_SPI0_INTER_EN                                (*((volatile uint8_t *)0x4040C002))                         // RW, SPI0 interrupt enable
#define R8_SPI0_CLOCK_DIV                               (*((volatile uint8_t *)0x4040C003))                         // RW, SPI0 master clock divisor
#define R8_SPI0_SLAVE_PRE                               (*((volatile uint8_t *)0x4040C003))                         // RW, SPI0 slave preset value
#define R32_SPI0_STATUS                                 (*((volatile uint32_t *)0x4040C004))                        // RW, SPI0 status
#define R8_SPI0_BUFFER                                  (*((volatile uint8_t *)0x4040C004))                         // RW, SPI0 data buffer
#define R8_SPI0_RUN_FLAG                                (*((volatile uint8_t *)0x4040C005))                         // RO, SPI0 work flag
#define R8_SPI0_INT_FLAG                                (*((volatile uint8_t *)0x4040C006))                         // RW1, SPI0 interrupt flag
#define R8_SPI0_FIFO_COUNT                              (*((volatile uint8_t *)0x4040C007))                         // RO, SPI0 FIFO count status
#define R8_SPI0_RESET_CMD                               (*((volatile uint8_t *)0x4040c008))                         //SPI0 reset command word register
#define R16_SPI0_TOTAL_CNT                              (*((volatile uint16_t *)0x4040C00C))                        // RW, SPI0 total byte count, only low 12 bit
#define R32_SPI0_FIFO                                   (*((volatile uint32_t *)0x4040C010))                        // RW, SPI0 FIFO register
#define R8_SPI0_FIFO                                    (*((volatile uint8_t *)0x4040C010))                         // RO/WO, SPI0 FIFO register
#define R8_SPI0_FIFO_COUNT1                             (*((volatile uint8_t *)0x4040C013))                         // RO, SPI0 FIFO count status
#define R32_SPI0_DMA_NOW                                (*((volatile uint32_t *)0x4040C014))                        // RW, SPI0 DMA current address
#define R32_SPI0_DMA_BEG                                (*((volatile uint32_t *)0x4040C018))                        // RW, SPI0 DMA begin address
#define R32_SPI0_DMA_END                                (*((volatile uint32_t *)0x4040C01C))                        // RW, SPI0 DMA end address

/* SPI1 register */                     
#define R32_SPI1_CONTROL                                (*((volatile uint32_t *)0x4040C800))                        // RW, SPI1 control
#define R8_SPI1_CTRL_MOD                                (*((volatile uint8_t *)0x4040C800))                         // RW, SPI1 mode control
#define R8_SPI1_CTRL_DMA                                (*((volatile uint8_t *)0x4040C801))                         // RW, SPI1 DMA control
#define R8_SPI1_INTER_EN                                (*((volatile uint8_t *)0x4040C802))                         // RW, SPI1 interrupt enable
#define R8_SPI1_CLOCK_DIV                               (*((volatile uint8_t *)0x4040C803))                         // RW, SPI1 master clock divisor
#define R32_SPI1_STATUS                                 (*((volatile uint32_t *)0x4040C804))                        // RW, SPI1 status
#define R8_SPI1_BUFFER                                  (*((volatile uint8_t *)0x4040C804))                         // RW, SPI1 data buffer
#define R8_SPI1_RUN_FLAG                                (*((volatile uint8_t *)0x4040C805))                         // RO, SPI1 work flag
#define R8_SPI1_INT_FLAG                                (*((volatile uint8_t *)0x4040C806))                         // RW1, SPI1 interrupt flag
#define R8_SPI1_FIFO_COUNT                              (*((volatile uint8_t *)0x4040C807))                         // RO, SPI1 FIFO count status
#define R16_SPI1_TOTAL_CNT                              (*((volatile uint16_t *)0x4040C80C))                        // RW, SPI1 total byte count, only low 12 bit
#define R32_SPI1_FIFO                                   (*((volatile uint32_t *)0x4040C810))                        // RW, SPI1 FIFO register
#define R8_SPI1_FIFO                                    (*((volatile uint8_t *)0x4040C810))                         // RO/WO, SPI1 FIFO register
#define R8_SPI1_FIFO_COUNT1                             (*((volatile uint8_t *)0x4040C813))                         // RO, SPI1 FIFO count status

