openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564.h
/* SPI register address offset and bit define */
#define SPI0_FIFO_SIZE                                  32                                                          // SPI0 FIFO size (depth)
#define SPI1_FIFO_SIZE                                  16                                                          // SPI1 FIFO size (depth)
#define BA_SPI0                                         ((volatile uint8_t *)0x4040C000)                            // point SPI0 base address
#define BA_SPI1                                         ((volatile uint8_t *)0x4040C800)                            // point SPI1 base address
#define SPI_CTRL_MOD                                    0   
#define RB_SPI_MODE_SLAVE                               0x01                                                        // RW, SPI slave mode: 0=master/host, 1=slave/device
#define RB_SPI_ALL_CLEAR                                0x02                                                        // RW, force clear SPI FIFO and count
#define RB_SPI_2WIRE_MOD                                0x04                                                        // RW, SPI enable 2 wire mode: 0=3wire(SCK,MOSI,MISO), 1=2wire(SCK,MISO=SDX)
#define RB_SPI_MST_SCK_MOD                              0x08                                                        // RW, SPI master clock mode: 0=mode 0, 1=mode 3
#define RB_SPI_SLV_CMD_MOD                              0x08                                                        // RW, SPI slave command mode: 0=byte stream, 1=first byte command
#define RB_SPI_FIFO_DIR                                 0x10                                                        // RW, SPI FIFO direction: 0=out(write @master mode), 1=in(read @master mode)
#define RB_SPI_SCK_OE                                   0x20                                                        // RW, SPI SCK output enable
#define RB_SPI_MOSI_OE                                  0x40                                                        // RW, SPI MOSI output enable
#define RB_SPI1_SDO_OE                                  0x40                                                        // RW, SPI1 SDO output enable
#define RB_SPI_MISO_OE                                  0x80                                                        // RW, SPI MISO output enable
#define RB_SPI1_SDI_OE                                  0x80                                                        // RW, SPI1 SDI output enable, SPI1 enable 2 wire mode: 0=3wire(SCK1,SDO,SDI), 1=2wire(SCK1,SDX1)
#define SPI_CTRL_DMA                                    1                                   
#define RB_SPI_DMA_ENABLE                               0x01                                                        // RW, SPI DMA enable
#define RB_SPI_DMA_BURST                                0x02                                                        // RW, SPI DMA burst enable
#define RB_SPI_DMA_LOOP                                 0x04                                                        // RW, SPI DMA address loop enable
#define RB_SPI_HS_HOST                                  0x80                                                        // RW, High speed host receive mode control bit
#define SPI_INTER_EN                                    2                                   
#define RB_SPI_IE_CNT_END                               0x01                                                        // RW, enable interrupt for SPI total byte count end
#define RB_SPI_IE_BYTE_END                              0x02                                                        // RW, enable interrupt for SPI byte exchanged
#define RB_SPI_IE_FIFO_HF                               0x04                                                        // RW, enable interrupt for SPI FIFO half
#define RB_SPI_IE_DMA_END                               0x08                                                        // RW, enable interrupt for SPI DMA completion
#define RB_SPI_IE_FIFO_OV                               0x10                                                        // RW, enable interrupt for SPI FIFO overflow
#define RB_SPI_IE_DMA_ERR                               0x20                                                        // RW, enable interrupt for SPI DMA respond error
#define RB_SPI_IE_FST_BYTE                              0x80                                                        // RW, enable interrupt for SPI slave mode first byte received
#define SPI_CLOCK_DIV                                   3                                   
#define SPI_SLAVE_PRESET                                3                                   
#define SPI_BUFFER                                      4                                   
#define SPI_RUN_FLAG                                    5                                   
#define RB_SPI_SLV_CMD_ACT                              0x10                                                        // RO, SPI slave command flag
#define RB_SPI_FIFO_READY                               0x20                                                        // RO, SPI FIFO ready status
#define RB_SPI_SLV_CS_LOAD                              0x40                                                        // RO, SPI slave chip-select loading status
#define RB_SPI_SLV_SELECT                               0x80                                                        // RO, SPI slave selection status
#define SPI_INT_FLAG                                    6                                   
#define RB_SPI_IF_CNT_END                               0x01                                                        // RW1, interrupt flag for SPI total byte count end
#define RB_SPI_IF_BYTE_END                              0x02                                                        // RW1, interrupt flag for SPI byte exchanged
#define RB_SPI_IF_FIFO_HF                               0x04                                                        // RW1, interrupt flag for SPI FIFO half
#define RB_SPI_IF_DMA_END                               0x08                                                        // RW1, interrupt flag for SPI DMA completion
#define RB_SPI_IF_FIFO_OV                               0x10                                                        // RW1, interrupt flag for SPI FIFO overflow
#define RB_SPI_IF_DMA_ERR                               0x20                                                        // RW1, interrupt flag for SPI DMA respond error
#define RB_SPI_FREE                                     0x40                                                        // RO, current SPI free status
#define RB_SPI_IF_FST_BYTE                              0x80                                                        // RW1, interrupt flag for SPI slave mode first byte received
#define SPI_FIFO_COUNT                                  7                                   
#define SPI_TOTAL_CNT                                   0x0C                                    
#define SPI_FIFO                                        0x10                                    
#define SPI0_DMA_NOW                                    20                                  
#define MASK_SPI0_DMA_ADDR                              0x0003ffff                                                  //SPI DMA current address

/* Timer0 register */
#define R32_TMR0_CONTROL                                (*((volatile uint32_t *)0x40408000))                        // RW, TMR0 control
#define R8_TMR0_CTRL_MOD                                (*((volatile uint8_t *)0x40408000))                         // RW, TMR0 mode control
#define R8_TMR0_CTRL_DMA                                (*((volatile uint8_t *)0x40408001))                         // RW, TMR0 DMA control
#define R8_TMR0_INTER_EN                                (*((volatile uint8_t *)0x40408002))                         // RW, TMR0 interrupt enable
#define R32_TMR0_STATUS                                 (*((volatile uint32_t *)0x40408004))                        // RW, TMR0 status
#define R8_TMR0_INT_FLAG                                (*((volatile uint8_t *)0x40408006))                         // RW1, TMR0 interrupt flag
#define R8_TMR0_FIFO_COUNT                              (*((volatile uint8_t *)0x40408007))                         // RO, TMR0 FIFO count status
#define R32_TMR0_COUNT                                  (*((volatile uint32_t *)0x40408008))                        // RO, TMR0 current count
#define R16_TMR0_COUNT                                  (*((volatile uint16_t *)0x40408008))                        // RO, TMR0 current count
#define R8_TMR0_COUNT                                   (*((volatile uint8_t *)0x40408008))                         // RO, TMR0 current count
#define R32_TMR0_CNT_END                                (*((volatile uint32_t *)0x4040800C))                        // RW, TMR0 end count value, only low 28 bit
#define R32_TMR0_FIFO                                   (*((volatile uint32_t *)0x40408010))                        // RO/WO, TMR0 FIFO register, only low 28 bit
#define R16_TMR0_FIFO                                   (*((volatile uint16_t *)0x40408010))                        // RO/WO, TMR0 FIFO register
#define R8_TMR0_FIFO                                    (*((volatile uint8_t *)0x40408010))                         // RO/WO, TMR0 FIFO register
#define R32_TMR0_DMA_NOW                                (*((volatile uint32_t *)0x40408014))                        // RW, TMR0 DMA current address
#define R32_TMR0_DMA_BEG                                (*((volatile uint32_t *)0x40408018))                        // RW, TMR0 DMA begin address
#define R32_TMR0_DMA_END                                (*((volatile uint32_t *)0x4040801C))                        // RW, TMR0 DMA end address

