openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564.h
/* Timer1 register */                       
#define R32_TMR1_CONTROL                                (*((volatile uint32_t *)0x40408400))                        // RW, TMR1 control
#define R8_TMR1_CTRL_MOD                                (*((volatile uint8_t *)0x40408400))                         // RW, TMR1 mode control
#define R8_TMR1_CTRL_DMA                                (*((volatile uint8_t *)0x40408401))                         // RW, TMR1 DMA control
#define R8_TMR1_INTER_EN                                (*((volatile uint8_t *)0x40408402))                         // RW, TMR1 interrupt enable
#define R8_TMR1_NRZI_CK_DIV                             (*((volatile uint8_t *)0x40408403))                         // RW, TMR1 NRZI clock divisor, only low 4 bit, from 0 to 15
#define R32_TMR1_STATUS                                 (*((volatile uint32_t *)0x40408404))                        // RW, TMR1 status
#define R8_TMR1_NRZI_STATUS                             (*((volatile uint8_t *)0x40408404))                         // RO, TMR1 NRZI status
#define R8_TMR1_INT_FLAG                                (*((volatile uint8_t *)0x40408406))                         // RW1, TMR1 interrupt flag
#define R8_TMR1_FIFO_COUNT                              (*((volatile uint8_t *)0x40408407))                         // RO, TMR1 FIFO count status
#define R32_TMR1_COUNT                                  (*((volatile uint32_t *)0x40408408))                        // RO, TMR1 current count
#define R16_TMR1_COUNT                                  (*((volatile uint16_t *)0x40408408))                        // RO, TMR1 current count
#define R8_TMR1_COUNT                                   (*((volatile uint8_t *)0x40408408))                         // RO, TMR1 current count
#define R32_TMR1_CNT_END                                (*((volatile uint32_t *)0x4040840C))                        // RW, TMR1 end count value, only low 28 bit
#define R32_TMR1_FIFO                                   (*((volatile uint32_t *)0x40408410))                        // RO/WO, TMR1 FIFO register, only low 28 bit
#define R16_TMR1_FIFO                                   (*((volatile uint16_t *)0x40408410))                        // RO/WO, TMR1 FIFO register
#define R8_TMR1_FIFO                                    (*((volatile uint8_t *)0x40408410))                         // RO/WO, TMR1 FIFO register
#define R32_TMR1_DMA_NOW                                (*((volatile uint32_t *)0x40408414))                        // RW, TMR1 DMA current address
#define R32_TMR1_DMA_BEG                                (*((volatile uint32_t *)0x40408418))                        // RW, TMR1 DMA begin address
#define R32_TMR1_DMA_END                                (*((volatile uint32_t *)0x4040841C))                        // RW, TMR1 DMA end address

/* Timer2 register */                       
#define R32_TMR2_CONTROL                                (*((volatile uint32_t *)0x40408800))                        // RW, TMR2 control
#define R8_TMR2_CTRL_MOD                                (*((volatile uint8_t *)0x40408800))                         // RW, TMR2 mode control
#define R8_TMR2_CTRL_DMA                                (*((volatile uint8_t *)0x40408801))                         // RW, TMR2 DMA control
#define R8_TMR2_INTER_EN                                (*((volatile uint8_t *)0x40408802))                         // RW, TMR2 interrupt enable
#define R32_TMR2_STATUS                                 (*((volatile uint32_t *)0x40408804))                        // RW, TMR2 status
#define R8_TMR2_INT_FLAG                                (*((volatile uint8_t *)0x40408806))                         // RW1, TMR2 interrupt flag
#define R8_TMR2_FIFO_COUNT                              (*((volatile uint8_t *)0x40408807))                         // RO, TMR2 FIFO count status
#define R32_TMR2_COUNT                                  (*((volatile uint32_t *)0x40408808))                        // RO, TMR2 current count
#define R16_TMR2_COUNT                                  (*((volatile uint16_t *)0x40408808))                        // RO, TMR2 current count
#define R8_TMR2_COUNT                                   (*((volatile uint8_t *)0x40408808))                         // RO, TMR2 current count
#define R32_TMR2_CNT_END                                (*((volatile uint32_t *)0x4040880C))                        // RW, TMR2 end count value, only low 28 bit
#define R32_TMR2_FIFO                                   (*((volatile uint32_t *)0x40408810))                        // RO/WO, TMR2 FIFO register, only low 28 bit
#define R16_TMR2_FIFO                                   (*((volatile uint16_t *)0x40408810))                        // RO/WO, TMR2 FIFO register
#define R8_TMR2_FIFO                                    (*((volatile uint8_t *)0x40408810))                         // RO/WO, TMR2 FIFO register
#define R32_TMR2_DMA_NOW                                (*((volatile uint32_t *)0x40408814))                        // RW, TMR2 DMA current address
#define R32_TMR2_DMA_BEG                                (*((volatile uint32_t *)0x40408818))                        // RW, TMR2 DMA begin address
#define R32_TMR2_DMA_END                                (*((volatile uint32_t *)0x4040881C))                        // RW, TMR2 DMA end address

/* Timer3 register */                       
#define R32_TMR3_CONTROL                                (*((volatile uint32_t *)0x40408C00))                        // RW, TMR3 control
#define R8_TMR3_CTRL_MOD                                (*((volatile uint8_t *)0x40408C00))                         // RW, TMR3 mode control
#define R8_TMR3_INTER_EN                                (*((volatile uint8_t *)0x40408C02))                         // RW, TMR3 interrupt enable
#define R32_TMR3_STATUS                                 (*((volatile uint32_t *)0x40408C04))                        // RW, TMR3 status
#define R8_TMR3_INT_FLAG                                (*((volatile uint8_t *)0x40408C06))                         // RW1, TMR3 interrupt flag
#define R8_TMR3_FIFO_COUNT                              (*((volatile uint8_t *)0x40408C07))                         // RO, TMR3 FIFO count status
#define R32_TMR3_COUNT                                  (*((volatile uint32_t *)0x40408C08))                        // RO, TMR3 current count
#define R16_TMR3_COUNT                                  (*((volatile uint16_t *)0x40408C08))                        // RO, TMR3 current count
#define R8_TMR3_COUNT                                   (*((volatile uint8_t *)0x40408C08))                         // RO, TMR3 current count
#define R32_TMR3_CNT_END                                (*((volatile uint32_t *)0x40408C0C))                        // RW, TMR3 end count value, only low 28 bit
#define R32_TMR3_FIFO                                   (*((volatile uint32_t *)0x40408C10))                        // RO/WO, TMR3 FIFO register, only low 28 bit
#define R16_TMR3_FIFO                                   (*((volatile uint16_t *)0x40408C10))                        // RO/WO, TMR3 FIFO register
#define R8_TMR3_FIFO                                    (*((volatile uint8_t *)0x40408C10))                         // RO/WO, TMR3 FIFO register

