openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564.h
/* Timer register address offset and bit define */
#define TMR_FIFO_SIZE                                   8                                                           // timer FIFO size (depth)
#define BA_TMR0                                         ((volatile uint8_t *)0x40408000)                            // point TMR0 base address
#define BA_TMR1                                         ((volatile uint8_t *)0x40408400)                            // point TMR1 base address
#define BA_TMR2                                         ((volatile uint8_t *)0x40408800)                            // point TMR2 base address
#define BA_TMR3                                         ((volatile uint8_t *)0x40408C00)                            // point TMR3 base address
#define TMR_CTRL_MOD                                    0
#define RB_TMR_MODE_IN                                  0x01                                                        // RW, timer in mode: 0=timer/PWM/count/NRZI encode, 1=catcher/NRZI decode
#define RB_TMR_ALL_CLEAR                                0x02                                                        // RW, force clear timer FIFO and count
#define RB_TMR_COUNT_EN                                 0x04                                                        // RW, timer count enable
#define RB_TMR_OUT_EN                                   0x08                                                        // RW, timer output enable
#define RB_TMR_OUT_POLAR                                0x10                                                        // RW, timer PWM/NRZI encode output polarity: 0=high action, 1=low action
#define RB_TMR_CAT_WIDTH                                0x10                                                        // RW, timer catcher input pulse min width selection: 0=16*clock, 1=8*clock
#define RB_TMR_MODE_NRZI                                0x20                                                        // RW, TMR0/TMR1 NRZI mode: 0=timer/PWM/catcher, 1=NRZI encode/decode
#define RB_TMR3_MODE_COUNT                              0x20                                                        // RW, TMR3 count mode: 0=timer/PWM/catcher/NRZI, 1=count
#define RB_TMR_PWM_REPEAT                               0xC0                                                        // RW, timer PWM repeat mode: 00=1, 01=4, 10=8, 11-16
#define RB_TMR_CATCH_EDGE                               0xC0                                                        // RW, timer catcher edge mode: 00=disable, 01=edge change, 10=fall to fall, 11-rise to rise
#define TMR_CTRL_DMA                                    1
#define RB_TMR_DMA_ENABLE                               0x01                                                        // RW, timer DMA enable
#define RB_TMR_DMA_BURST                                0x02                                                        // RW, timer DMA burst enable
#define RB_TMR_DMA_LOOP                                 0x04                                                        // RW, timer DMA address loop enable
#define TMR_INTER_EN                                    2
#define RB_TMR_IE_CYC_END                               0x01                                                        // RW, enable interrupt for timer catcher count timeout or PWM cycle end
#define RB_TMR_IE_DATA_ACT                              0x02                                                        // RW, enable interrupt for timer catcher input action or PWM trigger or NRZI recv packet end/tran packet end
#define RB_TMR_IE_FIFO_HF                               0x04                                                        // RW, enable interrupt for timer FIFO half
#define RB_TMR_IE_DMA_END                               0x08                                                        // RW, enable interrupt for timer DMA completion
#define RB_TMR_IE_FIFO_OV                               0x10                                                        // RW, enable interrupt for timer FIFO overflow
#define RB_TMR_IE_DMA_ERR                               0x20                                                        // RW, enable interrupt for timer DMA respond error
#define RB_TMR3_FORCE_EN                                0x80                                                        // RW, TMR3 force together timer0/1/2 count enable, independent of RB_TMR_COUNT_EN
#define TMR_NRZI_CK_DIV                                 3
#define TMR_NRZI_STATUS                                 4
#define RB_TMR_RECV_FREE                                0x01                                                        // RO, timer NRZI receiver free status, 0->1 then RB_TMR_IF_DATA_ACT for recv
#define RB_TMR_RECV_ERR                                 0x02                                                        // RO, timer NRZI receiving error status, 0->1 then RB_TMR_IF_NRZI_AUX for recv
#define RB_TMR_TRAN_END                                 0x10                                                        // RO, timer NRZI transmittal end status, 0->1 then RB_TMR_IF_DATA_ACT for tran
#define RB_TMR_TRAN_DOE                                 0x20                                                        // RO, timer NRZI transmitter encode output enable status, 0->1 then RB_TMR_IF_NRZI_AUX for tran
#define TMR_INT_FLAG                                    6
#define RB_TMR_IF_CYC_END                               0x01                                                        // RW1, interrupt flag for timer catcher count timeout or PWM cycle end
#define RB_TMR_IF_DATA_ACT                              0x02                                                        // RW1, interrupt flag for timer catcher input action or PWM trigger or NRZI recv packet end/tran packet end
#define RB_TMR_IF_FIFO_HF                               0x04                                                        // RW1, interrupt flag for timer FIFO half
#define RB_TMR_IF_DMA_END                               0x08                                                        // RW1, interrupt flag for timer DMA completion
#define RB_TMR_IF_FIFO_OV                               0x10                                                        // RW1, interrupt flag for timer FIFO overflow
#define RB_TMR_IF_DMA_ERR                               0x20                                                        // RW1, interrupt flag for timer DMA respond error
#define TMR_FIFO_COUNT                                  7
#define TMR_COUNT                                       0x08
#define TMR_CNT_END                                     0x0C
#define TMR_FIFO                                        0x10
#define TMR_DMA_NOW                                     0x14
#define TMR_DMA_BEG                                     0x18
#define TMR_DMA_END                                     0x1C
#define MASK_TMR_DMA_ADDR                               0x0003ffff

#define BA_XBUS                         ((uint32_t *)0x60C00000)                                                         // point XBUS base address
#define SZ_XBUS                         0x00100000                                                                    // XBUS size

#include "ch564_conf.h"

#define BITS_CFG(REGISTER,bit,en) ((en) == ENABLE ? (REGISTER |= (uint32_t)(bit)) : (REGISTER &= (uint32_t)~(bit)))


#ifdef __cplusplus
}
#endif

#endif
